emacs.org
#+TITLE: Une Configuration Emacs


:NOTE:
;; -*- mode: emacs-lisp ; fill-column: 80 ; indent-tabs-mode: t -*-

Voir le manuel à la section Specifying File Variables pour la définition des variables locales à un buffer sur la première ligne de ce dernier.

Utiliser C-u 1 M-x byte-recompile-directory pour produire des ~.elc~. Attention cependant, les fichiers compilés avec une version d'Emacs peuvent poser problème si utilisés avec une autre version.
:END:

#+BEGIN_abstract
Voici ma configuration Emacs - un chantier jamais fini - au {{{time(%d/%m/%Y)}}}. Cette configuration prend la forme d'un [[http://dist.jmontmartin.net/emacs.org][fichier Org]], à partir duquel sont générés une [[file:emacs.html][documentation HTML]], ainsi que le [[file:emacs.el][fichier Lisp]] qui constituait auparavant mon ~.emacs~. Ce dernier s'est transformé en un petit [[file:loader.el][fichier de chargement]], qui valorise quelques raccourcis (et autres détails spécifiques au poste sur lequel il se trouve) avant de charger le Lisp généré.

C'est également un essai pour voir ce qu'on peut faire avec [[http://orgmode.org/][Org]]. Ce fichier n'a pas fini de se transformer, et peut-être retournera-t-il à sa forme originelle, à savoir un simple fichier Lisp. Un attendant, un grand merci à [[http://gongzhitaao.org/orgcss][Zhitao Gong]] pour le CSS qui habille les exports HTML.
#+END_abstract

#+TOC: headlines 4


* À propos du temps

La fonction ~last-step-duration~, appelée régulièrement, permet de voir comment le temps s'écoule lors du chargement du ~.emacs~. À chaque appel, elle laisse une trace dans le buffer ~*Messages*~ avec le temps écoulé depuis l'appel précédent, ainsi que le temps total écoulé depuis le début du chargement du fichier. Certainement pas un modèle de Lisp, mais remplit son office et aide à comprendre pourquoi Emacs est parfois lent à démarrer.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun reset-ts()
    (setq first-ts (current-time))
    (setq last-ts first-ts))

  (defun step-duration()
    (let* ((ts (current-time))
	   (elapsed (float-time (time-subtract ts last-ts))))
      (setq last-ts ts)
      elapsed))

  (defun total-duration()
    (let* ((ts (current-time))
	   (elapsed (float-time (time-subtract ts first-ts))))
      elapsed))

  (defun last-step-duration(title)
    (message "Τ=%.3fs\tΔ=%.3fs\t%s" (total-duration) (step-duration) title))

  (reset-ts)
#+END_SRC

Ce code apparait en début de fichier afin d'initialiser une variable globale contenant le /time stamp/ de début de chargement de ce ~.emacs~. Bien que ses appels ne soient pas exportés dans le HTML généré, la fonction ~last-step-duration~ est utilisée régulièrement, à la fin de chaque section. Exemple de trace :

#+BEGIN_EXAMPLE
Τ=2.516s	Δ=0.016s	Rainbow delimiters
#+END_EXAMPLE

* Prérequis et compilation des packages

Comme suggéré dans la [[https://github.com/emacs-helm/helm/wiki#upgrade-or-recompile][doc de Helm]], pour compiler les packages dans de bonnes conditions (en particulier, avec les dépendances dans le bon ordre).

#+BEGIN_SRC emacs-lisp :tangle yes
(setq async-bytecomp-allowed-packages '(all))
#+END_SRC

D'après la [[https://github.com/jwiegley/use-package?tab=readme-ov-file#semantics-of-init-is-now-consistent][doc de use-package]], pour réduire les temps de chargement.

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-when-compile
    (require 'use-package))
  (require 'bind-key)
#+END_SRC

Use-package installe automatiquement tous les packages manquants.

#+BEGIN_SRC emacs-lisp :tangle no
  (setq use-package-always-ensure t)
#+END_SRC

