emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2026-03-20 ven. 15:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Une Configuration Emacs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Une Configuration Emacs</h1>
<div class="abstract" id="org5fe208e">
<p>
Voici ma configuration Emacs - un chantier jamais fini - au 20/03/2026. Cette configuration prend la forme d'un <a href="http://dist.jmontmartin.net/emacs.org">fichier Org</a>, à partir duquel sont générés une <a href="emacs.html">documentation HTML</a>, ainsi que le <a href="emacs.el">fichier Lisp</a> qui constituait auparavant mon <code>.emacs</code>. Ce dernier s'est transformé en un petit <a href="loader.el">fichier de chargement</a>, qui valorise quelques raccourcis (et autres détails spécifiques au poste sur lequel il se trouve) avant de charger le Lisp généré.
</p>

<p>
C'est également un essai pour voir ce qu'on peut faire avec <a href="http://orgmode.org/">Org</a>. Ce fichier n'a pas fini de se transformer, et peut-être retournera-t-il à sa forme originelle, à savoir un simple fichier Lisp. Un attendant, un grand merci à <a href="http://gongzhitaao.org/orgcss">Zhitao Gong</a> pour le CSS qui habille les exports HTML.
</p>

</div>

<div id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdf5926c">À propos du temps</a></li>
<li><a href="#org100b789">Prérequis et compilation des packages</a></li>
<li><a href="#orgc0a6c36">Généralités</a></li>
<li><a href="#org47a11f2">Raccourcis Fn</a></li>
<li><a href="#org89f0b5a">UTF-8</a></li>
<li><a href="#orgacd9519">Navigation dans les buffers</a></li>
<li><a href="#orgf30c418">Copier/coller</a></li>
<li><a href="#org468a992">Parenthèses et C<sup>ie</sup></a></li>
<li><a href="#orga11fba3">Mise à jour du path</a></li>
<li><a href="#orga4485db">Ajustements à l'OS</a>
<ul>
<li><a href="#org41da701">Linux</a></li>
<li><a href="#org2706b6d">Mac</a></li>
</ul>
</li>
<li><a href="#orgfb7ed8e">Gestionnaire de paquets</a></li>
<li><a href="#org94fc89f">Tree Sitter</a></li>
<li><a href="#org3cfc7fd">Bookmarks</a></li>
<li><a href="#org149bea6">C &amp; C++</a></li>
<li><a href="#orgc81e594">CMake</a></li>
<li><a href="#orgf64a74f">Corfu</a></li>
<li><a href="#orgc3088ac">EasyPG Assistant</a></li>
<li><a href="#org3c6c451">Ediff</a></li>
<li><a href="#orgce3a143">Eglot</a></li>
<li><a href="#orgab17f15">Graphviz</a></li>
<li><a href="#org1a31960">Helm</a></li>
<li><a href="#org5d1e2b8">Htmlize</a></li>
<li><a href="#orgf26343c">Idle HighLight Mode</a></li>
<li><a href="#orgd4447cf">Lisp</a></li>
<li><a href="#org4b067b9">Magit</a></li>
<li><a href="#orgaa7972f">MMM Mode</a></li>
<li><a href="#org935ab7a">Org</a>
<ul>
<li><a href="#orgd2e7c2e">Mise à jour</a></li>
</ul>
</li>
<li><a href="#orgdc04a5f">Prettify Symbols</a></li>
<li><a href="#orgfdf9eed">Projectile</a></li>
<li><a href="#org998ae28">Rainbow delimiters</a></li>
<li><a href="#orgbc45740">Rainbow mode</a></li>
<li><a href="#org76cc172">Related</a></li>
<li><a href="#org9d1d42a">Shell scripts</a></li>
<li><a href="#org086dec8">Souris</a></li>
<li><a href="#org4cade50">TabTab minor mode</a></li>
<li><a href="#org8fa8061">Tcl</a></li>
<li><a href="#org9fb9a1b">Thèmes</a>
<ul>
<li><a href="#org51b8098">Thème standard</a></li>
<li><a href="#orge3694c6">Thème Leuven</a></li>
<li><a href="#org7fef5ae">Thème Nord</a></li>
<li><a href="#org96015b0">Changer de thème facilement</a></li>
</ul>
</li>
<li><a href="#orgc94f706">Tramp</a></li>
<li><a href="#orge53a0a8">Unfill</a></li>
<li><a href="#org45ea2d4">Uniquify</a></li>
<li><a href="#org48d631f">Whitespace</a></li>
<li><a href="#orgfc731db">Ws-butler</a></li>
<li><a href="#org2e9e7b1">XML</a></li>
<li><a href="#org25586cf">Installation automatique</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdf5926c" class="outline-2">
<h2 id="orgdf5926c">À propos du temps</h2>
<div class="outline-text-2" id="text-orgdf5926c">
<p>
La fonction <code>last-step-duration</code>, appelée régulièrement, permet de voir comment le temps s'écoule lors du chargement du <code>.emacs</code>. À chaque appel, elle laisse une trace dans le buffer <code>*Messages*</code> avec le temps écoulé depuis l'appel précédent, ainsi que le temps total écoulé depuis le début du chargement du fichier. Certainement pas un modèle de Lisp, mais remplit son office et aide à comprendre pourquoi Emacs est parfois lent à démarrer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">reset-ts</span><span style="color: #0000ff;">()</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> first-ts <span style="color: #a0522d;">(</span>current-time<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> last-ts first-ts<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">step-duration</span><span style="color: #0000ff;">()</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">let*</span> <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>ts <span style="color: #b22222;">(</span>current-time<span style="color: #b22222;">)</span><span style="color: #800080;">)</span>
       <span style="color: #800080;">(</span>elapsed <span style="color: #b22222;">(</span>float-time <span style="color: #4f7400;">(</span>time-subtract ts last-ts<span style="color: #4f7400;">)</span><span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span><span style="color: #800080;">setq</span> last-ts ts<span style="color: #a0522d;">)</span>
    elapsed<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">total-duration</span><span style="color: #0000ff;">()</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">let*</span> <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>ts <span style="color: #b22222;">(</span>current-time<span style="color: #b22222;">)</span><span style="color: #800080;">)</span>
       <span style="color: #800080;">(</span>elapsed <span style="color: #b22222;">(</span>float-time <span style="color: #4f7400;">(</span>time-subtract ts first-ts<span style="color: #4f7400;">)</span><span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    elapsed<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">last-step-duration</span><span style="color: #0000ff;">(</span>title<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span>message <span style="color: #8b2252;">"&#932;=%.3fs\t&#916;=%.3fs\t%s"</span> <span style="color: #a0522d;">(</span>total-duration<span style="color: #a0522d;">)</span> <span style="color: #a0522d;">(</span>step-duration<span style="color: #a0522d;">)</span> title<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span>reset-ts<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Ce code apparait en début de fichier afin d'initialiser une variable globale contenant le <i>time stamp</i> de début de chargement de ce <code>.emacs</code>. Bien que ses appels ne soient pas exportés dans le HTML généré, la fonction <code>last-step-duration</code> est utilisée régulièrement, à la fin de chaque section. Exemple de trace :
</p>

<pre class="example" id="orgd9b40f1">
Τ=2.516s	Δ=0.016s	Rainbow delimiters
</pre>
</div>
</div>
<div id="outline-container-org100b789" class="outline-2">
<h2 id="org100b789">Prérequis et compilation des packages</h2>
<div class="outline-text-2" id="text-org100b789">
<p>
Comme suggéré dans la <a href="https://github.com/emacs-helm/helm/wiki#upgrade-or-recompile">doc de Helm</a>, pour compiler les packages dans de bonnes conditions (en particulier, avec les dépendances dans le bon ordre).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> async-bytecomp-allowed-packages '<span style="color: #0000ff;">(</span>all<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
D'après la <a href="https://github.com/jwiegley/use-package?tab=readme-ov-file#semantics-of-init-is-now-consistent">doc de use-package</a>, pour réduire les temps de chargement.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">eval-when-compile</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">require</span> '<span style="color: #008b8b;">use-package</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
<span style="color: #191970;">(</span><span style="color: #800080;">require</span> '<span style="color: #008b8b;">bind-key</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Use-package installe automatiquement tous les packages manquants.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> use-package-always-ensure t<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
