emacs.org
* Généralités

Désactive l'écran d'accueil, Emacs s'ouvre avec le buffer ~scratch~

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq inhibit-startup-screen t)
#+END_SRC

Affichage du nom du buffer dans la barre de titre

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq frame-title-format '(buffer-file-name "Emacs: %b (%f)" "Emacs: %b"))
#+END_SRC

Dans le terminal, pas de barre de menu

#+BEGIN_SRC emacs-lisp :tangle yes
  (unless window-system (menu-bar-mode -1))
#+END_SRC

En mode graphique, cache la barre d'outils

#+BEGIN_SRC emacs-lisp :tangle yes
  (when window-system (tool-bar-mode -1))
#+END_SRC

En mode graphique, gouttière réduite à gauche uniquement (nil pour remettre la taille par défaut).

#+BEGIN_SRC emacs-lisp :tangle no
  (when window-system (set-fringe-mode '(4 . 0)))
#+END_SRC

En mode graphique, barre de défilement à droite (-1 pour désactiver)

#+BEGIN_SRC emacs-lisp :tangle yes
  (when window-system (set-scroll-bar-mode 'right))
#+END_SRC

Un buffer pour lequel Emacs n'a attribué aucun mode majeur s'ouvre en mode texte.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default major-mode 'text-mode)
#+END_SRC

Une ligne de 80 caractères est suffisamment longue. La variable ~default-fill-column~ affecte de nombreuses commandes comme ~fill-paragraph~, ainsi que des modes mineurs comme ~whitespace-mode~. Pour ceux qui le souhaitent, appliquer la règle des 80 colonnes commence par là.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq default-fill-column 80)
#+END_SRC

Indentation avec des tabulations de 4 caractères

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default c-basic-offset 4
		tab-width 4
		indent-tabs-mode t)
#+END_SRC

En fin de buffer, les touches flèches ne créent pas une nouvelle ligne

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default next-line-add-newlines nil)
#+END_SRC

Affichage de la ligne et de la colonne du curseur dans la mode line. Voir aussi ~display-line-numbers-mode~ qui affiche les numéros de lignes dans le buffer, bien pratique quand on partage son écran.

#+BEGIN_SRC emacs-lisp :tangle yes
  (line-number-mode t)
  (column-number-mode t)
#+END_SRC

Pour utiliser ~narrow-to-region~ via son raccourci clavier {{{CTRL-(n)}}} {{{KBD-(n)}}}

#+BEGIN_SRC emacs-lisp :tangle yes
  (put 'narrow-to-region 'disabled nil)
#+END_SRC

Désactive la /transient mark/. La région est toujours active, mais pas surlignée. Au besoin, la transient mark est activée le temps d'une commande avec {{{CTRL-(SPC)}}} {{{CTRL-(SPC)}}}. Correspond à l'ancien comportement d'Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq transient-mark-mode nil)
#+END_SRC

Dans un environnement graphique, lance Emacs en mode serveur. Depuis un terminal, ~emacs-client~ permet alors d'ouvrir les fichiers dans cette instance d'Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (when window-system (server-start))
#+END_SRC

Des modules peuvent se trouver dans ~site-lisp~. On ajoute ce répertoire à la variable ~load-path~ afin qu'ils soient trouvés par la commande ~require~.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'load-path "~/.emacs.d/site-lisp/")
#+END_SRC

Place les /backups/ (copie d'un fichier avant modifications) et les sauvegardes automatiques (faites périodiquement pendant qu'on édite un fichier) dans un répertoire temporaire, selon la plateforme :

- sur Mac : ~/var/folders/xxx~
- sur Windows : ~c:/Users/yyy/AppData/Local/Temp~
- sur Linux : ~/tmp~

L'expression régulière ~".*"~ ci-après indique que la règle concerne tous les fichiers, car on peut faire, par exemple, des règles différentes selon l'extension.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq backup-directory-alist `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))
#+END_SRC

Mise en évidence de la ligne en cours dans Dired

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'dired-mode-hook 'hl-line-mode)
#+END_SRC

Sur Mac, Dired utilise GNU ~ls~ si disponible

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eq system-type 'darwin)
    (if (file-executable-p "/usr/local/bin/gls")
	(setq insert-directory-program "/usr/local/bin/gls")))
#+END_SRC

Common Lisp, pour ~ignore-errors~ et d'autres

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'cl-lib)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Généralités")
#+END_SRC

