emacs.html
<div id="outline-container-orgc0a6c36" class="outline-2">
<h2 id="orgc0a6c36">Généralités</h2>
<div class="outline-text-2" id="text-orgc0a6c36">
<p>
Désactive l'écran d'accueil, Emacs s'ouvre avec le buffer <code>scratch</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> inhibit-startup-screen t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Affichage du nom du buffer dans la barre de titre
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> frame-title-format '<span style="color: #0000ff;">(</span>buffer-file-name <span style="color: #8b2252;">"Emacs: %b (%f)"</span> <span style="color: #8b2252;">"Emacs: %b"</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Dans le terminal, pas de barre de menu
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">unless</span> window-system <span style="color: #0000ff;">(</span>menu-bar-mode -1<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
En mode graphique, cache la barre d'outils
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">when</span> window-system <span style="color: #0000ff;">(</span>tool-bar-mode -1<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
En mode graphique, gouttière réduite à gauche uniquement (nil pour remettre la taille par défaut).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">when</span> window-system <span style="color: #0000ff;">(</span>set-fringe-mode '<span style="color: #a0522d;">(</span>4 . 0<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
En mode graphique, barre de défilement à droite (-1 pour désactiver)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">when</span> window-system <span style="color: #0000ff;">(</span>set-scroll-bar-mode 'right<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Un buffer pour lequel Emacs n'a attribué aucun mode majeur s'ouvre en mode texte.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq-default</span> major-mode 'text-mode<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Une ligne de 80 caractères est suffisamment longue. La variable <code>default-fill-column</code> affecte de nombreuses commandes comme <code>fill-paragraph</code>, ainsi que des modes mineurs comme <code>whitespace-mode</code>. Pour ceux qui le souhaitent, appliquer la règle des 80 colonnes commence par là.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> default-fill-column 80<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Indentation avec des tabulations de 4 caractères
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq-default</span> c-basic-offset 4
        tab-width 4
        indent-tabs-mode t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
En fin de buffer, les touches flèches ne créent pas une nouvelle ligne
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq-default</span> next-line-add-newlines nil<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Affichage de la ligne et de la colonne du curseur dans la mode line. Voir aussi <code>display-line-numbers-mode</code> qui affiche les numéros de lignes dans le buffer, bien pratique quand on partage son écran.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>line-number-mode t<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>column-number-mode t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Pour utiliser <code>narrow-to-region</code> via son raccourci clavier <kbd>C</kbd>-<kbd>n</kbd><kbd>n</kbd>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>put 'narrow-to-region 'disabled nil<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Désactive la <i>transient mark</i>. La région est toujours active, mais pas surlignée. Au besoin, la transient mark est activée le temps d'une commande avec <kbd>C</kbd>-<kbd>SPC</kbd><kbd>C</kbd>-<kbd>SPC</kbd>. Correspond à l'ancien comportement d'Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> transient-mark-mode nil<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Dans un environnement graphique, lance Emacs en mode serveur. Depuis un terminal, <code>emacs-client</code> permet alors d'ouvrir les fichiers dans cette instance d'Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">when</span> window-system <span style="color: #0000ff;">(</span>server-start<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Des modules peuvent se trouver dans <code>site-lisp</code>. On ajoute ce répertoire à la variable <code>load-path</code> afin qu'ils soient trouvés par la commande <code>require</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-to-list 'load-path <span style="color: #8b2252;">"~/.emacs.d/site-lisp/"</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Place les <i>backups</i> (copie d'un fichier avant modifications) et les sauvegardes automatiques (faites périodiquement pendant qu'on édite un fichier) dans un répertoire temporaire, selon la plateforme :
</p>

<ul class="org-ul">
<li>sur Mac : <code>/var/folders/xxx</code></li>
<li>sur Windows : <code>c:/Users/yyy/AppData/Local/Temp</code></li>
<li>sur Linux : <code>/tmp</code></li>
</ul>

<p>
L'expression régulière <code>".*"</code> ci-après indique que la règle concerne tous les fichiers, car on peut faire, par exemple, des règles différentes selon l'extension.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> backup-directory-alist `<span style="color: #0000ff;">(</span><span style="color: #a0522d;">(</span><span style="color: #8b2252;">".*"</span> . ,temporary-file-directory<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
<span style="color: #191970;">(</span><span style="color: #800080;">setq</span> auto-save-file-name-transforms `<span style="color: #0000ff;">(</span><span style="color: #a0522d;">(</span><span style="color: #8b2252;">".*"</span> ,temporary-file-directory t<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Mise en évidence de la ligne en cours dans Dired
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-hook 'dired-mode-hook 'hl-line-mode<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Sur Mac, Dired utilise GNU <code>ls</code> si disponible
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">when</span> <span style="color: #0000ff;">(</span>eq system-type 'darwin<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">if</span> <span style="color: #a0522d;">(</span>file-executable-p <span style="color: #8b2252;">"/usr/local/bin/gls"</span><span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span><span style="color: #800080;">setq</span> insert-directory-program <span style="color: #8b2252;">"/usr/local/bin/gls"</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Common Lisp, pour <code>ignore-errors</code> et d'autres
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">require</span> '<span style="color: #008b8b;">cl-lib</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
