emacs.el

(setq inhibit-startup-screen t)

(setq frame-title-format '(buffer-file-name "Emacs: %b (%f)" "Emacs: %b"))

(unless window-system (menu-bar-mode -1))

(when window-system (tool-bar-mode -1))

(when window-system (set-scroll-bar-mode 'right))

(setq-default major-mode 'text-mode)

(setq default-fill-column 80)

(setq-default c-basic-offset 4
		tab-width 4
		indent-tabs-mode t)

(setq-default next-line-add-newlines nil)

(line-number-mode t)
(column-number-mode t)

(put 'narrow-to-region 'disabled nil)

(setq transient-mark-mode nil)

(when window-system (server-start))

(add-to-list 'load-path "~/.emacs.d/site-lisp/")

(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))

(add-hook 'dired-mode-hook 'hl-line-mode)

(when (eq system-type 'darwin)
  (if (file-executable-p "/usr/local/bin/gls")
	(setq insert-directory-program "/usr/local/bin/gls")))

(require 'cl-lib)

(last-step-duration "Généralités")
