emacs.org
* Raccourcis Fn

Quelques raccourcis pratiquent sur les touches fonctions, certains inspirés de Visual Studio ou de Xcode. Lorsqu'il est lancé en mode texte depuis un terminal, Emacs ne voit pas les raccourcis en {{{CTRL-(Fn)}}}. Pour cette raison, ils sont en général doublés sur {{{SHIFT-(Fn)}}}.

- {{{KBD-(F1)}}} pour ~view-mode~, qui permet de passer un buffer qu'on ne veut pas modifier en lecture seule
- {{{CTRL-(F1)}}} pour ~revert-buffer~, qui permet de revenir à la dernière version sauvegardée du fichier

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; À la place de view-order-manuals qui est normalement sur f1
  (global-set-key (kbd "<f1>")	'view-mode)
  (global-set-key (kbd "C-<f1>")	'revert-buffer)
  (global-set-key (kbd "S-<f1>")	'revert-buffer)
#+END_SRC

- {{{KBD-(F2)}}} pour ~bm-toggle~, qui insère (ou retire) un marque-page sur la ligne. La ligne marquée est alors surlignée
- {{{CTRL-(F2)}}} et {{{SHIFT-(F2)}}} pour ~bm-next~ et ~bm-previous~, qui permettent de parcourir les marques-pages

En mode terminal {{{CTRL-(f2)}}} ne fonctionne pas, et parcourir les marques-pages avec Helm via {{{CTRL-(F2)}}} est plus pratique. Dans tous les cas, ~helm-bm~ est disponible via {{{CTRL-(c)}}} {{{KBD-(b)}}}.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f2>")	'bm-toggle)
  (global-set-key (kbd "C-<f2>")	'bm-next)
  (global-set-key (kbd "S-<f2>")	'bm-previous)

  (unless window-system
    (global-set-key (kbd "S-<f2>")	'helm-bm))
#+END_SRC

- {{{KBD-(F3)}}} pour ~hl-line-mode~, bien pratique quand on a besoin de se concentrer sur une ligne, ou lorsqu'on doit traiter un buffer une ligne après l'autre.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f3>")	'hl-line-mode)
#+END_SRC

- {{{KBD-(F4)}}} pour ~projectile-grep~ (ou ~helm-projectile-grep~ si Helm est activé). Si Projectile est disponible pour un projet, permet de chercher interactivement dans les fichiers de ce projet. Vraiment très utile ! Fonctionne particulièrement bien avec {{{CTRL-(c)}}} {{{KBD-(h)}}} {{{KBD-(b)}}}, qui comme toujours avec Helm, permet de ramener les dernières propositions...

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f4>")	'projectile-grep)
#+END_SRC

- {{{KBD-(F5)}}} pour ~run-compilation~, fonction perso qui sauvegarde l'agencement des buffers affichés avant de lancer une compilation
- {{{CTRL-(F5)}}} pour ~end-compilation~, qui met fin à une session de compilation et restaure l'affichage

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f5>")	'run-compilation)
  (global-set-key (kbd "C-<f5>")	'end-compilation)
  (global-set-key (kbd "S-<f5>")	'end-compilation)
#+END_SRC

- {{{KBD-(F6)}}} pour ~projectile-multi-occur~, qui lance ~occur~ dans tous les buffers ouverts appartenant au projet du buffer courant
- {{{CTRL-(F6)}}} pour ~helm-occur~, qui lance une version interactive depuis Helm de ~occur~ : La liste des correspondances est construite dynamiquement lors de la frappe, et à tout moment {{{KBD-(↑)}}} et {{{KBD-(↓)}}} permettent d'en sélectionner une, pour laquelle {{{KBD-(TAB)}}} donnera un aperçu.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f6>")	'projectile-multi-occur)
  (global-set-key (kbd "C-<f6>")	'helm-occur)
  (global-set-key (kbd "S-<f6>")	'helm-occur)
#+END_SRC

- {{{KBD-(F8)}}} pour ~display-fill-column-indicator-mode~, qui met en évidence la colonne 80 dans les modes de développement.
- {{{CTRL-(F8)}}} pour désactiver (ou réactiver) [[*Whitespace]] lorsqu'il devient trop intrusif, en particulier avec les lignes trop longues.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f8>")	'display-fill-column-indicator-mode)
  (global-set-key (kbd "C-<f8>")	'whitespace-mode)
  (global-set-key (kbd "S-<f8>")	'whitespace-mode)
#+END_SRC

- {{{KBD-(F9)}}} pour itérérer sur les thèmes prédéfinis (voir [[*Changer de thème facilement]])

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "<f9>")	'switch-theme)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Raccourcis Fn")
#+END_SRC

* UTF-8

Autant que possible, on veut de l'UTF-8. De nombreuses variables permettent de configurer finement les divers comportements d'Emacs en matière d'encodage (voir par exemple [[https://stackoverflow.com/a/2903256][cette réponse]] sur Stack Overflow). Mais la simple directive ~set-language-environment~ réalise un paramétrage par défaut satisfaisant.

#+BEGIN_SRC emacs-lisp :tangle yes
  (set-language-environment 'utf-8)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "UTF-8")
#+END_SRC

