emacs.html
<div id="outline-container-org47a11f2" class="outline-2">
<h2 id="org47a11f2">Raccourcis Fn</h2>
<div class="outline-text-2" id="text-org47a11f2">
<p>
Quelques raccourcis pratiquent sur les touches fonctions, certains inspirés de Visual Studio ou de Xcode. Lorsqu'il est lancé en mode texte depuis un terminal, Emacs ne voit pas les raccourcis en <kbd>C</kbd>-<kbd>Fn</kbd>. Pour cette raison, ils sont en général doublés sur <kbd>S</kbd>-<kbd>Fn</kbd>.
</p>

<ul class="org-ul">
<li><kbd>F1</kbd>pour <code>view-mode</code>, qui permet de passer un buffer qu'on ne veut pas modifier en lecture seule</li>
<li><kbd>C</kbd>-<kbd>F1</kbd>pour <code>revert-buffer</code>, qui permet de revenir à la dernière version sauvegardée du fichier</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#192; la place de view-order-manuals qui est normalement sur f1
</span><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f1&gt;"</span><span style="color: #0000ff;">)</span>    'view-mode<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-&lt;f1&gt;"</span><span style="color: #0000ff;">)</span>  'revert-buffer<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"S-&lt;f1&gt;"</span><span style="color: #0000ff;">)</span>  'revert-buffer<span style="color: #191970;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><kbd>F2</kbd>pour <code>bm-toggle</code>, qui insère (ou retire) un marque-page sur la ligne. La ligne marquée est alors surlignée</li>
<li><kbd>C</kbd>-<kbd>F2</kbd>et <kbd>S</kbd>-<kbd>F2</kbd>pour <code>bm-next</code> et <code>bm-previous</code>, qui permettent de parcourir les marques-pages</li>
</ul>

<p>
En mode terminal <kbd>C</kbd>-<kbd>f2</kbd>ne fonctionne pas, et parcourir les marques-pages avec Helm via <kbd>C</kbd>-<kbd>F2</kbd>est plus pratique. Dans tous les cas, <code>helm-bm</code> est disponible via <kbd>C</kbd>-<kbd>c</kbd><kbd>b</kbd>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f2&gt;"</span><span style="color: #0000ff;">)</span>    'bm-toggle<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-&lt;f2&gt;"</span><span style="color: #0000ff;">)</span>  'bm-next<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"S-&lt;f2&gt;"</span><span style="color: #0000ff;">)</span>  'bm-previous<span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">unless</span> window-system
  <span style="color: #0000ff;">(</span>global-set-key <span style="color: #a0522d;">(</span>kbd <span style="color: #8b2252;">"S-&lt;f2&gt;"</span><span style="color: #a0522d;">)</span>    'helm-bm<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><kbd>F3</kbd>pour <code>hl-line-mode</code>, bien pratique quand on a besoin de se concentrer sur une ligne, ou lorsqu'on doit traiter un buffer une ligne après l'autre.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f3&gt;"</span><span style="color: #0000ff;">)</span>    'hl-line-mode<span style="color: #191970;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><kbd>F4</kbd>pour <code>projectile-grep</code> (ou <code>helm-projectile-grep</code> si Helm est activé). Si Projectile est disponible pour un projet, permet de chercher interactivement dans les fichiers de ce projet. Vraiment très utile ! Fonctionne particulièrement bien avec <kbd>C</kbd>-<kbd>c</kbd><kbd>h</kbd><kbd>b</kbd>, qui comme toujours avec Helm, permet de ramener les dernières propositions&#x2026;</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f4&gt;"</span><span style="color: #0000ff;">)</span>    'projectile-grep<span style="color: #191970;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><kbd>F5</kbd>pour <code>run-compilation</code>, fonction perso qui sauvegarde l'agencement des buffers affichés avant de lancer une compilation</li>
<li><kbd>C</kbd>-<kbd>F5</kbd>pour <code>end-compilation</code>, qui met fin à une session de compilation et restaure l'affichage</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f5&gt;"</span><span style="color: #0000ff;">)</span>    'run-compilation<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-&lt;f5&gt;"</span><span style="color: #0000ff;">)</span>  'end-compilation<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"S-&lt;f5&gt;"</span><span style="color: #0000ff;">)</span>  'end-compilation<span style="color: #191970;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><kbd>F6</kbd>pour <code>projectile-multi-occur</code>, qui lance <code>occur</code> dans tous les buffers ouverts appartenant au projet du buffer courant</li>
<li><kbd>C</kbd>-<kbd>F6</kbd>pour <code>helm-occur</code>, qui lance une version interactive depuis Helm de <code>occur</code> : La liste des correspondances est construite dynamiquement lors de la frappe, et à tout moment <kbd>↑</kbd>et <kbd>↓</kbd>permettent d'en sélectionner une, pour laquelle <kbd>TAB</kbd>donnera un aperçu.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f6&gt;"</span><span style="color: #0000ff;">)</span>    'projectile-multi-occur<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-&lt;f6&gt;"</span><span style="color: #0000ff;">)</span>  'helm-occur<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"S-&lt;f6&gt;"</span><span style="color: #0000ff;">)</span>  'helm-occur<span style="color: #191970;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><kbd>F8</kbd>pour <code>display-fill-column-indicator-mode</code>, qui met en évidence la colonne 80 dans les modes de développement.</li>
<li><kbd>C</kbd>-<kbd>F8</kbd>pour désactiver (ou réactiver) <a href="#org48d631f">Whitespace</a> lorsqu'il devient trop intrusif, en particulier avec les lignes trop longues.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f8&gt;"</span><span style="color: #0000ff;">)</span>    'display-fill-column-indicator-mode<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-&lt;f8&gt;"</span><span style="color: #0000ff;">)</span>  'whitespace-mode<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"S-&lt;f8&gt;"</span><span style="color: #0000ff;">)</span>  'whitespace-mode<span style="color: #191970;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><kbd>F9</kbd>pour itérérer sur les thèmes prédéfinis (voir <a href="#org96015b0">Changer de thème facilement</a>)</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;f9&gt;"</span><span style="color: #0000ff;">)</span>    'switch-theme<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org89f0b5a" class="outline-2">
<h2 id="org89f0b5a">UTF-8</h2>
<div class="outline-text-2" id="text-org89f0b5a">
<p>
Autant que possible, on veut de l'UTF-8. De nombreuses variables permettent de configurer finement les divers comportements d'Emacs en matière d'encodage (voir par exemple <a href="https://stackoverflow.com/a/2903256">cette réponse</a> sur Stack Overflow). Mais la simple directive <code>set-language-environment</code> réalise un paramétrage par défaut satisfaisant.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>set-language-environment 'utf-8<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
