emacs.org
* Navigation dans les buffers

Lorsqu'on navigue dans les buffers, on préfère sauter les buffers ouverts automatiquement par Dired, Helm, ou autre, comme ~*compilation*~ par exemple. On définit pour cela la fonction ~navigate-nostar-buffer~, qui cherche le prochain buffer ne commençant pas par ~*~ (ou le précédent si appelé avec un argument).

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun navigate-nostar-buffer (&optional previous)
    "Navigate to next \"no star\" buffer, or previous one if PREVIOUS is t."
    (let ((start-buffer (buffer-name)))
      (cl-flet ((next-f () (if previous (next-buffer) (previous-buffer))))
	(next-f)
	(while
	    (and (string-match-p "^\*" (buffer-name))
		 (not (equal start-buffer (buffer-name))))
	  (next-f)))))

  (defun navigate-next-nostar-buffer ()
    "Navigate to next \"no star\" buffer."
    (interactive)
    (navigate-nostar-buffer))

  (defun navigate-previous-nostar-buffer ()
    "Navigate to previous \"no star\" buffer."
    (interactive)
    (navigate-nostar-buffer t))
#+END_SRC

Puis on utilise [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Remapping-Commands.html][~remap~]] pour réaffecter les raccourcis de ~next-buffer~ et ~previous-buffer~, {{{CTRL-(x)}}} {{{KBD-(←)}}} et {{{CTRL-(x)}}} {{{KBD-(→)}}} respectivement.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key [remap next-buffer] 'navigate-next-nostar-buffer)
  (global-set-key [remap previous-buffer] 'navigate-previous-nostar-buffer)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Navigation dans les buffers")
#+END_SRC

* Copier/coller

Le bouton du milieu colle le texte au niveau du point, sans le déplacer

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq mouse-yank-at-point t)
#+END_SRC

Lorsqu'on copie depuis Emacs alors qu'une autre application avait placé du texte dans le presse-papier, ce texte est ajouté au kill ring avant d'être remplacé. Très pratique, car cela évite de perdre du texte copié, par exemple depuis internet, avant d'avoir eu le temps de l'utiliser.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq save-interprogram-paste-before-kill t)
#+END_SRC

Le texte surligné est automatiquement copié dans le kill ring

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq mouse-drag-copy-region t)
#+END_SRC

Voir aussi la [[AppleCopyPaste][réaffectation des touches à problèmes sur mac]].

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Copier/coller")
#+END_SRC

* Parenthèses et C^ie

Lorsque le curseur est sur une parenthèse ouvrante, ou immédiatement derrière une parenthèse fermante, la paire de parenthèses est surlignée. De même avec les accolades et les crochets.

#+BEGIN_SRC emacs-lisp :tangle yes
  (show-paren-mode 1)
#+END_SRC

Éventuellement, si on veut surligner également l'expression entre parenthèses

#+BEGIN_SRC emacs-lisp :tangle no
  (setq show-paren-style 'expression)
#+END_SRC

Les parenthèses sont surlignées en bleu. Voir aussi [[*Rainbow delimiters]].

#+BEGIN_SRC emacs-lisp :tangle yes
  (set-face-background 'show-paren-match "#b5d5ff")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Parenthèses et Cie")
#+END_SRC

