emacs.html
<div id="outline-container-orgacd9519" class="outline-2">
<h2 id="orgacd9519">Navigation dans les buffers</h2>
<div class="outline-text-2" id="text-orgacd9519">
<p>
Lorsqu'on navigue dans les buffers, on préfère sauter les buffers ouverts automatiquement par Dired, Helm, ou autre, comme <code>*compilation*</code> par exemple. On définit pour cela la fonction <code>navigate-nostar-buffer</code>, qui cherche le prochain buffer ne commençant pas par <code>*</code> (ou le précédent si appelé avec un argument).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">navigate-nostar-buffer</span> <span style="color: #0000ff;">(</span><span style="color: #228b22;">&amp;optional</span> previous<span style="color: #0000ff;">)</span>
  <span style="color: #8b2252;">"Navigate to next \"no star\" buffer, or previous one if PREVIOUS is t."</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">let</span> <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>start-buffer <span style="color: #b22222;">(</span>buffer-name<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span><span style="color: #800080;">cl-flet</span> <span style="color: #800080;">(</span><span style="color: #b22222;">(</span>next-f <span style="color: #4f7400;">()</span> <span style="color: #4f7400;">(</span><span style="color: #800080;">if</span> previous <span style="color: #008b8b;">(</span>next-buffer<span style="color: #008b8b;">)</span> <span style="color: #008b8b;">(</span>previous-buffer<span style="color: #008b8b;">)</span><span style="color: #4f7400;">)</span><span style="color: #b22222;">)</span><span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>next-f<span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span><span style="color: #800080;">while</span>
        <span style="color: #b22222;">(</span><span style="color: #800080;">and</span> <span style="color: #4f7400;">(</span>string-match-p <span style="color: #8b2252;">"^</span><span style="color: #b6532f;">\</span><span style="color: #8b2252;">*"</span> <span style="color: #008b8b;">(</span>buffer-name<span style="color: #008b8b;">)</span><span style="color: #4f7400;">)</span>
         <span style="color: #4f7400;">(</span>not <span style="color: #008b8b;">(</span>equal start-buffer <span style="color: #483d8b;">(</span>buffer-name<span style="color: #483d8b;">)</span><span style="color: #008b8b;">)</span><span style="color: #4f7400;">)</span><span style="color: #b22222;">)</span>
      <span style="color: #b22222;">(</span>next-f<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">navigate-next-nostar-buffer</span> <span style="color: #0000ff;">()</span>
  <span style="color: #8b2252;">"Navigate to next \"no star\" buffer."</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span>navigate-nostar-buffer<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">navigate-previous-nostar-buffer</span> <span style="color: #0000ff;">()</span>
  <span style="color: #8b2252;">"Navigate to previous \"no star\" buffer."</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span>navigate-nostar-buffer t<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Puis on utilise <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Remapping-Commands.html"><code>remap</code></a> pour réaffecter les raccourcis de <code>next-buffer</code> et <code>previous-buffer</code>, <kbd>C</kbd>-<kbd>x</kbd><kbd>←</kbd>et <kbd>C</kbd>-<kbd>x</kbd><kbd>→</kbd>respectivement.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">[</span>remap next-buffer<span style="color: #0000ff;">]</span> 'navigate-next-nostar-buffer<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">[</span>remap previous-buffer<span style="color: #0000ff;">]</span> 'navigate-previous-nostar-buffer<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf30c418" class="outline-2">
<h2 id="orgf30c418">Copier/coller</h2>
<div class="outline-text-2" id="text-orgf30c418">
<p>
Le bouton du milieu colle le texte au niveau du point, sans le déplacer
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> mouse-yank-at-point t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Lorsqu'on copie depuis Emacs alors qu'une autre application avait placé du texte dans le presse-papier, ce texte est ajouté au kill ring avant d'être remplacé. Très pratique, car cela évite de perdre du texte copié, par exemple depuis internet, avant d'avoir eu le temps de l'utiliser.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> save-interprogram-paste-before-kill t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Le texte surligné est automatiquement copié dans le kill ring
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> mouse-drag-copy-region t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Voir aussi la <a href="#orgb18ce46">réaffectation des touches à problèmes sur mac</a>.
</p>
</div>
</div>
<div id="outline-container-org468a992" class="outline-2">
<h2 id="org468a992">Parenthèses et C<sup>ie</sup></h2>
<div class="outline-text-2" id="text-org468a992">
<p>
Lorsque le curseur est sur une parenthèse ouvrante, ou immédiatement derrière une parenthèse fermante, la paire de parenthèses est surlignée. De même avec les accolades et les crochets.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>show-paren-mode 1<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Éventuellement, si on veut surligner également l'expression entre parenthèses
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> show-paren-style 'expression<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Les parenthèses sont surlignées en bleu. Voir aussi <a href="#org998ae28">Rainbow delimiters</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>set-face-background 'show-paren-match <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #b5d5ff;">#b5d5ff</span><span style="color: #8b2252;">"</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
