emacs.el

(defun navigate-nostar-buffer (&optional previous)
  "Navigate to next \"no star\" buffer, or previous one if PREVIOUS is t."
  (let ((start-buffer (buffer-name)))
    (cl-flet ((next-f () (if previous (next-buffer) (previous-buffer))))
	(next-f)
	(while
	    (and (string-match-p "^\*" (buffer-name))
		 (not (equal start-buffer (buffer-name))))
	  (next-f)))))

(defun navigate-next-nostar-buffer ()
  "Navigate to next \"no star\" buffer."
  (interactive)
  (navigate-nostar-buffer))

(defun navigate-previous-nostar-buffer ()
  "Navigate to previous \"no star\" buffer."
  (interactive)
  (navigate-nostar-buffer t))

(global-set-key [remap next-buffer] 'navigate-next-nostar-buffer)
(global-set-key [remap previous-buffer] 'navigate-previous-nostar-buffer)

(last-step-duration "Navigation dans les buffers")

(setq mouse-yank-at-point t)

(setq save-interprogram-paste-before-kill t)

(setq mouse-drag-copy-region t)

(last-step-duration "Copier/coller")

(show-paren-mode 1)

(set-face-background 'show-paren-match "#b5d5ff")

(last-step-duration "Parenthèses et Cie")
