emacs.org
* Mise à jour du path

C'est parfois utile d'enrichir un peu le path utilisé par Emacs. Il y a en fait plusieurs chemins, dont ces deux variables :

- ~exec-path~, qui est le path utilisé par Emacs pour chercher les binaires
- ~PATH~, qui est le path transmis aux commandes lancées par Emacs

Pour ma part je les traite ensembles, avec la fonction ~add-to-exec-paths~, qui
ajoute (s'il existe) à la fin des deux paths le répertoire passé en argument :

:NOTE:
- Filtrer les doublons ?
- Débugger avec (message "exec-path=%s" exec-path) et (message "PATH=%s" (getenv "PATH"))
:END:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun add-to-exec-paths(some-folder)
    (interactive)
    (cond
     ((file-exists-p some-folder)
      (add-to-list 'exec-path some-folder)
      (setenv "PATH" (concat (getenv "PATH") ":" some-folder))
      ;;(message "Added '%s' to PATH and exec-path" some-folder)
      )))
#+END_SRC

Reste à ajouter quelques répertoires, selon ses habitudes... Les paths inexistants ne sont pas ajoutés.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-exec-paths "~/bin")
  (add-to-exec-paths "~/scripts")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Maj du path")
#+END_SRC

* Ajustements à l'OS

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (cond
#+END_SRC

Selon la plateforme, on effectue quelques ajustements, en particulier les raccourcis clavier et les polices de caractères.

** Linux

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  ((string-match "linux" system-configuration)
   (progn
     (message "Tweak Emacs for Linux")
#+END_SRC

Fonte du terminal Xfce

#+BEGIN_SRC emacs-lisp :tangle yes
  (set-face-font 'default "-UKWN-Adwaita Mono-regular-normal-normal-*-*-*-*-*-m-0-iso10646-1")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  ))
#+END_SRC

** Mac

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  ((string-match "apple" system-configuration)
   (progn
     (message "Tweak Emacs for Mac")
#+END_SRC

Réaffectation des touches à problèmes sur Mac :
- {{{KBD-(cmd)}}} devient {{{KBD-(meta)}}}
- {{{KBD-(alt)}}} permet les raccourcis pour {{{KBD-(|)}}}, {{{KBD-(~)}}} et cie.

<<AppleCopyPaste>> En passant, on réaffecte les raccourcis de copier/coller classiques pour qu'ils se comportent comme {{{APPLE-(c)}}} et {{{APPLE-(v)}}}, car les erreurs quand on vient d'une autre applications font trop de dégats.

Pour pouvoir alterner facilement entre le clavier d'un mac et un clavier PC, on définit également une fonction qui rétablit les adaptations faites pour le mac.

:NOTE:
Les raccourcis de copier coller pourraient aussi être mis à jour sous Windows et Linux
:END:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun set-mac-keys()
    (interactive)
    (setq mac-command-key-is-meta t)
    (setq mac-command-modifier 'meta)

    (setq mac-option-key-is-meta nil)
    (setq mac-option-modifier nil)

    (global-set-key (kbd "M-c") 'kill-ring-save)
    (global-set-key (kbd "M-v") 'yank))

  (defun unset-mac-keys()
    (interactive)

    (setq mac-command-key-is-meta nil)
    (setq mac-command-modifier 'super)

    (setq mac-option-key-is-meta nil)
    (setq mac-option-modifier 'meta)

    (global-set-key (kbd "S-c") 'kill-ring-save)
    (global-set-key (kbd "S-v") 'yank))

  (set-mac-keys)
#+END_SRC

Ancienne fonte Xcode, si on la veut. Maintenant je préfère avoir un thème commun avec iTerm2.

#+BEGIN_SRC emacs-lisp :tangle no
  (set-face-font
   'menu "-apple-menlo-medium-r-normal--11-110-72-72-m-110-iso10646-1")
  (set-face-font
   'default "-apple-menlo-medium-r-normal--11-110-72-72-m-110-iso10646-1")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Ajustements à l'OS")
#+END_SRC

