emacs.html
<div id="outline-container-orga11fba3" class="outline-2">
<h2 id="orga11fba3">Mise à jour du path</h2>
<div class="outline-text-2" id="text-orga11fba3">
<p>
C'est parfois utile d'enrichir un peu le path utilisé par Emacs. Il y a en fait plusieurs chemins, dont ces deux variables :
</p>

<ul class="org-ul">
<li><code>exec-path</code>, qui est le path utilisé par Emacs pour chercher les binaires</li>
<li><code>PATH</code>, qui est le path transmis aux commandes lancées par Emacs</li>
</ul>

<p>
Pour ma part je les traite ensembles, avec la fonction <code>add-to-exec-paths</code>, qui
ajoute (s'il existe) à la fin des deux paths le répertoire passé en argument :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">add-to-exec-paths</span><span style="color: #0000ff;">(</span>some-folder<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">cond</span>
   <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>file-exists-p some-folder<span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>add-to-list 'exec-path some-folder<span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>setenv <span style="color: #8b2252;">"PATH"</span> <span style="color: #b22222;">(</span>concat <span style="color: #4f7400;">(</span>getenv <span style="color: #8b2252;">"PATH"</span><span style="color: #4f7400;">)</span> <span style="color: #8b2252;">":"</span> some-folder<span style="color: #b22222;">)</span><span style="color: #800080;">)</span>
    <span style="color: #b22222;">;;</span><span style="color: #b22222;">(message "Added '</span><span style="color: #008b8b;">%s</span><span style="color: #b22222;">' to PATH and exec-path" some-folder)
</span>    <span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Reste à ajouter quelques répertoires, selon ses habitudes&#x2026; Les paths inexistants ne sont pas ajoutés.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-to-exec-paths <span style="color: #8b2252;">"~/bin"</span><span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>add-to-exec-paths <span style="color: #8b2252;">"~/scripts"</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga4485db" class="outline-2">
<h2 id="orga4485db">Ajustements à l'OS</h2>
<div class="outline-text-2" id="text-orga4485db">
<p>
Selon la plateforme, on effectue quelques ajustements, en particulier les raccourcis clavier et les polices de caractères.
</p>
</div>
<div id="outline-container-org41da701" class="outline-3">
<h3 id="org41da701">Linux</h3>
<div class="outline-text-3" id="text-org41da701">
<p>
Fonte du terminal Xfce
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>set-face-font 'default <span style="color: #8b2252;">"-UKWN-Adwaita Mono-regular-normal-normal-*-*-*-*-*-m-0-iso10646-1"</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2706b6d" class="outline-3">
<h3 id="org2706b6d">Mac</h3>
<div class="outline-text-3" id="text-org2706b6d">
<p>
Réaffectation des touches à problèmes sur Mac :
</p>
<ul class="org-ul">
<li><kbd>cmd</kbd>devient <kbd>meta</kbd></li>
<li><kbd>alt</kbd>permet les raccourcis pour <kbd>|</kbd>, <kbd>~</kbd>et cie.</li>
</ul>

<p>
<a id="orgb18ce46"></a> En passant, on réaffecte les raccourcis de copier/coller classiques pour qu'ils se comportent comme <kbd>⌘</kbd>-<kbd>c</kbd>et <kbd>⌘</kbd>-<kbd>v</kbd>, car les erreurs quand on vient d'une autre applications font trop de dégats.
</p>

<p>
Pour pouvoir alterner facilement entre le clavier d'un mac et un clavier PC, on définit également une fonction qui rétablit les adaptations faites pour le mac.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">set-mac-keys</span><span style="color: #0000ff;">()</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-command-key-is-meta t<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-command-modifier 'meta<span style="color: #0000ff;">)</span>

  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-option-key-is-meta nil<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-option-modifier nil<span style="color: #0000ff;">)</span>

  <span style="color: #0000ff;">(</span>global-set-key <span style="color: #a0522d;">(</span>kbd <span style="color: #8b2252;">"M-c"</span><span style="color: #a0522d;">)</span> 'kill-ring-save<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span>global-set-key <span style="color: #a0522d;">(</span>kbd <span style="color: #8b2252;">"M-v"</span><span style="color: #a0522d;">)</span> 'yank<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">unset-mac-keys</span><span style="color: #0000ff;">()</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>

  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-command-key-is-meta nil<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-command-modifier 'super<span style="color: #0000ff;">)</span>

  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-option-key-is-meta nil<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> mac-option-modifier 'meta<span style="color: #0000ff;">)</span>

  <span style="color: #0000ff;">(</span>global-set-key <span style="color: #a0522d;">(</span>kbd <span style="color: #8b2252;">"S-c"</span><span style="color: #a0522d;">)</span> 'kill-ring-save<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span>global-set-key <span style="color: #a0522d;">(</span>kbd <span style="color: #8b2252;">"S-v"</span><span style="color: #a0522d;">)</span> 'yank<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span>set-mac-keys<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Ancienne fonte Xcode, si on la veut. Maintenant je préfère avoir un thème commun avec iTerm2.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>set-face-font
 'menu <span style="color: #8b2252;">"-apple-menlo-medium-r-normal--11-110-72-72-m-110-iso10646-1"</span><span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>set-face-font
 'default <span style="color: #8b2252;">"-apple-menlo-medium-r-normal--11-110-72-72-m-110-iso10646-1"</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
</div>
