emacs.el

(defun add-to-exec-paths(some-folder)
  (interactive)
  (cond
   ((file-exists-p some-folder)
    (add-to-list 'exec-path some-folder)
    (setenv "PATH" (concat (getenv "PATH") ":" some-folder))
    ;;(message "Added '%s' to PATH and exec-path" some-folder)
    )))

(add-to-exec-paths "~/bin")
(add-to-exec-paths "~/scripts")

(last-step-duration "Maj du path")

(cond

((string-match "linux" system-configuration)
 (progn
   (message "Tweak Emacs for Linux")

(set-face-font 'default "-UKWN-Adwaita Mono-regular-normal-normal-*-*-*-*-*-m-0-iso10646-1")

))

((string-match "apple" system-configuration)
 (progn
   (message "Tweak Emacs for Mac")

(defun set-mac-keys()
  (interactive)
  (setq mac-command-key-is-meta t)
  (setq mac-command-modifier 'meta)

  (setq mac-option-key-is-meta nil)
  (setq mac-option-modifier nil)

  (global-set-key (kbd "M-c") 'kill-ring-save)
  (global-set-key (kbd "M-v") 'yank))

(defun unset-mac-keys()
  (interactive)

  (setq mac-command-key-is-meta nil)
  (setq mac-command-modifier 'super)

  (setq mac-option-key-is-meta nil)
  (setq mac-option-modifier 'meta)

  (global-set-key (kbd "S-c") 'kill-ring-save)
  (global-set-key (kbd "S-v") 'yank))

(set-mac-keys)

)))

(last-step-duration "Ajustements à l'OS")
