emacs.org
* Gestionnaire de paquets

Charge le gestionnaire de paquets

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package package
#+END_SRC

On peut ensuite ajouter des sources de paquets, qui viendront alimenter la liste affichée par ~package-list-packages~.

Milkypostman’s Emacs Lisp Package Archive ([[http://melpa.org][MELPA]]), une source de paquets à avoir, la seule que j'ajoute systématiquement.

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (add-to-list 'package-archives
		       '("MELPA" . "http://melpa.org/packages/") t)
#+END_SRC

Pour ceux qui veulent une version bien à jour de [[http://orgmode.org][Org]], la source dédiée est pratique également.

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (add-to-list 'package-archives
		       '("Org" . "https://orgmode.org/elpa/") t)
#+END_SRC

En cas de problème avec les paquets, on peut supprimer le répertoire où tout est installé : ~~/.emacs.d/elpa/archives/melpa/archive-contents~.

[[https://marmalade-repo.org][Marmelade]] une autre source de paquets intéressante, moins dynamique que Melpa ces derniers temps, mais avec avec un système de validation différent.

#+BEGIN_SRC emacs-lisp :tangle no
  :config (add-to-list 'package-archives
		       '("Marmalade" . "http://marmalade-repo.org/packages/") t)
#+END_SRC

GNU Emacs Lisp Package Archive ([[http://elpa.gnu.org][ELPA]]) est la source de paquets officielle d'Emacs.

#+BEGIN_SRC emacs-lisp :tangle no
  :config (add-to-list 'package-archives
		       '("GNU" . "http://elpa.gnu.org/packages/") t)
#+END_SRC

[[http://orgmode.org][Org]] dispose également de sa propre source, pour ceux qui veulent garder très à jour ce paquet majeur.

#+BEGIN_SRC emacs-lisp :tangle no
  :config (add-to-list 'package-archives
		       '("Org" . "http://orgmode.org/elpa/") t)
#+END_SRC

Initialise le gestionnaire de paquet. Avec Helm, on peut utiliser ~helm-list-elisp-packages~ via {{{CTRL-(c)}}} {{{KBD-(h)}}} {{{KBD-(@)}}}

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (package-initialize))
#+END_SRC

Enfin, quelques commandes usuelles de gestion des paquets à ne pas oublier :

#+BEGIN_SRC emacs-lisp :tangle no
  (package-refresh-contents)
  (package-upgrade-all)
  (package-recompile-all)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Gestionnaire de paquets")
#+END_SRC

