emacs.html
<div id="outline-container-orgfb7ed8e" class="outline-2">
<h2 id="orgfb7ed8e">Gestionnaire de paquets</h2>
<div class="outline-text-2" id="text-orgfb7ed8e">
<p>
Charge le gestionnaire de paquets
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> package
</pre>
</div>

<p>
On peut ensuite ajouter des sources de paquets, qui viendront alimenter la liste affichée par <code>package-list-packages</code>.
</p>

<p>
Milkypostman’s Emacs Lisp Package Archive (<a href="http://melpa.org">MELPA</a>), une source de paquets à avoir, la seule que j'ajoute systématiquement.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>add-to-list 'package-archives
               '<span style="color: #0000ff;">(</span><span style="color: #8b2252;">"MELPA"</span> . <span style="color: #8b2252;">"http://melpa.org/packages/"</span><span style="color: #0000ff;">)</span> t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Pour ceux qui veulent une version bien à jour de <a href="http://orgmode.org">Org</a>, la source dédiée est pratique également.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>add-to-list 'package-archives
               '<span style="color: #0000ff;">(</span><span style="color: #8b2252;">"Org"</span> . <span style="color: #8b2252;">"https://orgmode.org/elpa/"</span><span style="color: #0000ff;">)</span> t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
En cas de problème avec les paquets, on peut supprimer le répertoire où tout est installé : <code>~/.emacs.d/elpa/archives/melpa/archive-contents</code>.
</p>

<p>
<a href="https://marmalade-repo.org">Marmelade</a> une autre source de paquets intéressante, moins dynamique que Melpa ces derniers temps, mais avec avec un système de validation différent.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>add-to-list 'package-archives
               '<span style="color: #0000ff;">(</span><span style="color: #8b2252;">"Marmalade"</span> . <span style="color: #8b2252;">"http://marmalade-repo.org/packages/"</span><span style="color: #0000ff;">)</span> t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
GNU Emacs Lisp Package Archive (<a href="http://elpa.gnu.org">ELPA</a>) est la source de paquets officielle d'Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>add-to-list 'package-archives
               '<span style="color: #0000ff;">(</span><span style="color: #8b2252;">"GNU"</span> . <span style="color: #8b2252;">"http://elpa.gnu.org/packages/"</span><span style="color: #0000ff;">)</span> t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
<a href="http://orgmode.org">Org</a> dispose également de sa propre source, pour ceux qui veulent garder très à jour ce paquet majeur.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>add-to-list 'package-archives
               '<span style="color: #0000ff;">(</span><span style="color: #8b2252;">"Org"</span> . <span style="color: #8b2252;">"http://orgmode.org/elpa/"</span><span style="color: #0000ff;">)</span> t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Initialise le gestionnaire de paquet. Avec Helm, on peut utiliser <code>helm-list-elisp-packages</code> via <kbd>C</kbd>-<kbd>c</kbd><kbd>h</kbd><kbd>@</kbd>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>package-initialize<span style="color: #191970;">)</span><span style="color: #000000; background-color: #ff8f88;">)</span>
</pre>
</div>

<p>
Enfin, quelques commandes usuelles de gestion des paquets à ne pas oublier :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>package-refresh-contents<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>package-upgrade-all<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>package-recompile-all<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
