emacs.el

(use-package package

:config (add-to-list 'package-archives
		       '("MELPA" . "http://melpa.org/packages/") t)

:config (add-to-list 'package-archives
		       '("Org" . "https://orgmode.org/elpa/") t)

:config (package-initialize))

(last-step-duration "Gestionnaire de paquets")
