emacs.org
* Tree Sitter

Des librairies compilées pour parser les différents langages, et une interface plus puissante pour manipuler les sources. En attendant que Tree Sitter soit mieux intégré à Emacs, il faut configurer les langages à la main.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (lua "https://github.com/Azganoth/tree-sitter-lua")
          (make "https://github.com/alemuller/tree-sitter-make")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (php "https://github.com/tree-sitter/tree-sitter-php" "master" "php/src")
          (ruby "https://github.com/tree-sitter/tree-sitter-ruby")
          (rust "https://github.com/tree-sitter/tree-sitter-rust")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")
          (zig "https://github.com/maxxnino/tree-sitter-zig")))
#+END_SRC

Ensuite, on les installe en lancant une fois la commande ~my-ts-languages-setup~

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my-ts-languages-setup ()
    "Install all languages specified by `treesit-language-source-alist'."
    (interactive)
    (let ((languages (mapcar 'car treesit-language-source-alist)))
      (dolist (lang languages)
        (unless (treesit-language-available-p lang)
          (treesit-install-language-grammar lang)
          (message "`%s' parser was installed." lang)
          (sit-for 0.75)))))
#+END_SRC

Active Tree Sitter dans tous les modes supportés

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq major-mode-remap-alist
  '((bash-mode . bash-ts-mode)
    (c-mode . c-ts-mode)
    (c++-mode . c++-ts-mode)
    (css-mode . css-ts-mode)
    (go-mode . go-ts-mode)
    (html-mode . html-ts-mode)
    (js-mode . js-ts-mode)
    (javascript-mode . js-ts-mode)
    (json-mode . json-ts-mode)
    (python-mode . python-ts-mode)
    (ruby-mode . ruby-ts-mode)
    (rust-mode . rust-ts-mode)
    (toml-mode . toml-ts-mode)))
 #+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Tree Sitter")
#+END_SRC

