emacs.html
<div id="outline-container-org94fc89f" class="outline-2">
<h2 id="org94fc89f">Tree Sitter</h2>
<div class="outline-text-2" id="text-org94fc89f">
<p>
Des librairies compilées pour parser les différents langages, et une interface plus puissante pour manipuler les sources. En attendant que Tree Sitter soit mieux intégré à Emacs, il faut configurer les langages à la main.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> treesit-language-source-alist
      '<span style="color: #0000ff;">(</span><span style="color: #a0522d;">(</span>bash <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-bash"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>c <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-c"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>cpp <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-cpp"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>css <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-css"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>go <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-go"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>html <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-html"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>javascript <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-javascript"</span> <span style="color: #8b2252;">"master"</span> <span style="color: #8b2252;">"src"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>json <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-json"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>lua <span style="color: #8b2252;">"https://github.com/Azganoth/tree-sitter-lua"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>make <span style="color: #8b2252;">"https://github.com/alemuller/tree-sitter-make"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>python <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-python"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>php <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-php"</span> <span style="color: #8b2252;">"master"</span> <span style="color: #8b2252;">"php/src"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>ruby <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-ruby"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>rust <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-rust"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>toml <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-toml"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>tsx <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-typescript"</span> <span style="color: #8b2252;">"master"</span> <span style="color: #8b2252;">"tsx/src"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>typescript <span style="color: #8b2252;">"https://github.com/tree-sitter/tree-sitter-typescript"</span> <span style="color: #8b2252;">"master"</span> <span style="color: #8b2252;">"typescript/src"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>yaml <span style="color: #8b2252;">"https://github.com/ikatyang/tree-sitter-yaml"</span><span style="color: #a0522d;">)</span>
        <span style="color: #a0522d;">(</span>zig <span style="color: #8b2252;">"https://github.com/maxxnino/tree-sitter-zig"</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Ensuite, on les installe en lancant une fois la commande <code>my-ts-languages-setup</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">my-ts-languages-setup</span> <span style="color: #0000ff;">()</span>
  <span style="color: #8b2252;">"Install all languages specified by `</span><span style="color: #008b8b;">treesit-language-source-alist</span><span style="color: #8b2252;">'."</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">let</span> <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>languages <span style="color: #b22222;">(</span>mapcar 'car treesit-language-source-alist<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span><span style="color: #800080;">dolist</span> <span style="color: #800080;">(</span>lang languages<span style="color: #800080;">)</span>
      <span style="color: #800080;">(</span><span style="color: #800080;">unless</span> <span style="color: #b22222;">(</span>treesit-language-available-p lang<span style="color: #b22222;">)</span>
        <span style="color: #b22222;">(</span>treesit-install-language-grammar lang<span style="color: #b22222;">)</span>
        <span style="color: #b22222;">(</span>message <span style="color: #8b2252;">"`</span><span style="color: #008b8b;">%s</span><span style="color: #8b2252;">' parser was installed."</span> lang<span style="color: #b22222;">)</span>
        <span style="color: #b22222;">(</span>sit-for 0.75<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Active Tree Sitter dans tous les modes supportés
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> major-mode-remap-alist
'<span style="color: #0000ff;">(</span><span style="color: #a0522d;">(</span>bash-mode . bash-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>c-mode . c-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>c++-mode . c++-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>css-mode . css-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>go-mode . go-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>html-mode . html-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>js-mode . js-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>javascript-mode . js-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>json-mode . json-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>python-mode . python-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>ruby-mode . ruby-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>rust-mode . rust-ts-mode<span style="color: #a0522d;">)</span>
  <span style="color: #a0522d;">(</span>toml-mode . toml-ts-mode<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
