emacs.org
* Bookmarks

Marque-pages à la Visual Studio : la ligne marquée est surlignée, et l'on peut ensuite naviguer d'un marque-page à l'autre. Beaucoup d'autres fonctionnalités très pratiques comme mettre les marque-pages automatiquement avec une expression régulière, par exemple pour explorer des logs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package bm
#+END_SRC

On parcourt avec ~bm-next~ et ~bm-previous~ l'ensemble des marque-pages de tous les buffers, et pas juste ceux du buffer courant.

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq bm-cycle-all-buffers t)
#+END_SRC

On surligne les lignes marquées en fuchsia, comme avec un coup de Stabilo !

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (custom-set-faces
	   '(bm-face ((t (:background "#ffafff")))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Bookmarks")
#+END_SRC

* C & C++

Accolades ouvrantes alignées sous le mot clé

#+BEGIN_SRC emacs-lisp :tangle yes
  (c-set-offset (quote substatement-open) 0)
#+END_SRC

Ouvre les ~.h~ comme du C++, et non comme du C

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq auto-mode-alist (append '(("\.h$" . c++-mode)) auto-mode-alist))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "C & C++")
#+END_SRC

* CMake

Le mode majeur pour éditer les fichiers CMake. Perfectible à mon avis, mais utile quand même. Plus d'informations sur le [[http://www.cmake.org/Wiki/CMake/Editors/Emacs][wiki]] de Kitware dédié à CMake.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package cmake-mode
#+END_SRC

Les fichiers CMake habituels s'ouvrent avec ~cmake-mode~

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq auto-mode-alist
		(append '(("CMakeLists\\.txt\\'" . cmake-mode))
			'(("\\.cmake\\'" . cmake-mode))
			auto-mode-alist))
#+END_SRC

Pas d'indentation automatique, en particulier après {{{KBD-(Enter)}}}

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (add-hook 'cmake-mode-hook (lambda () (electric-indent-mode -1)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "CMake")
#+END_SRC

* Corfu

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package corfu
  ;; :init
  ;; (global-corfu-mode)
  :config
  ;; Complétion automatique après 0.2s
  (setq corfu-auto t)
  (setq corfu-auto-delay 0.2)
  (setq corfu-auto-prefix 2)

  ;; Cycle dans les candidats
  (setq corfu-cycle t)

  ;; Preview du candidat sélectionné
  (setq corfu-preview-current t)

  ;; Navigation avec Tab
  :bind (:map corfu-map
              ("TAB" . corfu-next)
              ("S-TAB" . corfu-previous)
              ("RET" . corfu-insert))
#+END_SRC

 #+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package kind-icon
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Corfu")
#+END_SRC


* EasyPG Assistant

Une interface à GnuPG pour Emacs, qui permet entre autres de manipuler des fichiers cryptés de façon plus ou moins transparente. GnuPG doit être installé et configuré sur la machine.

Indique à EasyPG une clé par défaut, afin qu'il ne pose pas la question à chaque sauvegarde d'un fichier. Je vous laisse mettre la vôtre !

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq epa-file-encrypt-to "julien.montmartin@fastmail.fm")
#+END_SRC

Fonctionne bien aussi dans une variable en début de fichier :

#+BEGIN_SRC emacs-lisp :tangle no
  -*- epa-file-encrypt-to: ("julien.montmartin@fastmail.fm") -*-
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "EasyPG Assistant")
#+END_SRC

