emacs.html
<div id="outline-container-org3cfc7fd" class="outline-2">
<h2 id="org3cfc7fd">Bookmarks</h2>
<div class="outline-text-2" id="text-org3cfc7fd">
<p>
Marque-pages à la Visual Studio : la ligne marquée est surlignée, et l'on peut ensuite naviguer d'un marque-page à l'autre. Beaucoup d'autres fonctionnalités très pratiques comme mettre les marque-pages automatiquement avec une expression régulière, par exemple pour explorer des logs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> bm
</pre>
</div>

<p>
On parcourt avec <code>bm-next</code> et <code>bm-previous</code> l'ensemble des marque-pages de tous les buffers, et pas juste ceux du buffer courant.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> bm-cycle-all-buffers t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
On surligne les lignes marquées en fuchsia, comme avec un coup de Stabilo !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>custom-set-faces
       '<span style="color: #0000ff;">(</span>bm-face <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>t <span style="color: #b22222;">(</span><span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #ffafff;">#ffafff</span><span style="color: #8b2252;">"</span><span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org149bea6" class="outline-2">
<h2 id="org149bea6">C &amp; C++</h2>
<div class="outline-text-2" id="text-org149bea6">
<p>
Accolades ouvrantes alignées sous le mot clé
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>c-set-offset <span style="color: #0000ff;">(</span><span style="color: #800080;">quote</span> substatement-open<span style="color: #0000ff;">)</span> 0<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Ouvre les <code>.h</code> comme du C++, et non comme du C
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> auto-mode-alist <span style="color: #0000ff;">(</span>append '<span style="color: #a0522d;">(</span><span style="color: #800080;">(</span><span style="color: #8b2252;">"</span><span style="color: #b6532f;">\</span><span style="color: #8b2252;">.h$"</span> . c++-mode<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span> auto-mode-alist<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc81e594" class="outline-2">
<h2 id="orgc81e594">CMake</h2>
<div class="outline-text-2" id="text-orgc81e594">
<p>
Le mode majeur pour éditer les fichiers CMake. Perfectible à mon avis, mais utile quand même. Plus d'informations sur le <a href="http://www.cmake.org/Wiki/CMake/Editors/Emacs">wiki</a> de Kitware dédié à CMake.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> cmake-mode
</pre>
</div>

<p>
Les fichiers CMake habituels s'ouvrent avec <code>cmake-mode</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> auto-mode-alist
        <span style="color: #0000ff;">(</span>append '<span style="color: #a0522d;">(</span><span style="color: #800080;">(</span><span style="color: #8b2252;">"CMakeLists\\.txt\\'"</span> . cmake-mode<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
            '<span style="color: #a0522d;">(</span><span style="color: #800080;">(</span><span style="color: #8b2252;">"\\.cmake\\'"</span> . cmake-mode<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
            auto-mode-alist<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Pas d'indentation automatique, en particulier après <kbd>Enter</kbd>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>add-hook 'cmake-mode-hook <span style="color: #0000ff;">(</span><span style="color: #800080;">lambda</span> <span style="color: #a0522d;">()</span> <span style="color: #a0522d;">(</span>electric-indent-mode -1<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf64a74f" class="outline-2">
<h2 id="orgf64a74f">Corfu</h2>
<div class="outline-text-2" id="text-orgf64a74f">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> corfu
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">:init
</span>  <span style="color: #b22222;">;; </span><span style="color: #b22222;">(global-corfu-mode)
</span>  <span style="color: #483d8b;">:config</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Compl&#233;tion automatique apr&#232;s 0.2s
</span>  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> corfu-auto t<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> corfu-auto-delay 0.2<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> corfu-auto-prefix 2<span style="color: #0000ff;">)</span>

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Cycle dans les candidats
</span>  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> corfu-cycle t<span style="color: #0000ff;">)</span>

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Preview du candidat s&#233;lectionn&#233;
</span>  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> corfu-preview-current t<span style="color: #0000ff;">)</span>

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Navigation avec Tab
</span>  <span style="color: #483d8b;">:bind</span> <span style="color: #0000ff;">(</span><span style="color: #483d8b;">:map</span> corfu-map
              <span style="color: #a0522d;">(</span><span style="color: #8b2252;">"TAB"</span> . corfu-next<span style="color: #a0522d;">)</span>
              <span style="color: #a0522d;">(</span><span style="color: #8b2252;">"S-TAB"</span> . corfu-previous<span style="color: #a0522d;">)</span>
              <span style="color: #a0522d;">(</span><span style="color: #8b2252;">"RET"</span> . corfu-insert<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> kind-icon
  <span style="color: #483d8b;">:after</span> corfu
  <span style="color: #483d8b;">:config</span>
  <span style="color: #0000ff;">(</span>add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc3088ac" class="outline-2">
<h2 id="orgc3088ac">EasyPG Assistant</h2>
<div class="outline-text-2" id="text-orgc3088ac">
<p>
Une interface à GnuPG pour Emacs, qui permet entre autres de manipuler des fichiers cryptés de façon plus ou moins transparente. GnuPG doit être installé et configuré sur la machine.
</p>

<p>
Indique à EasyPG une clé par défaut, afin qu'il ne pose pas la question à chaque sauvegarde d'un fichier. Je vous laisse mettre la vôtre !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> epa-file-encrypt-to <span style="color: #8b2252;">"julien.montmartin@fastmail.fm"</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Fonctionne bien aussi dans une variable en début de fichier :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">-*- epa-file-encrypt-to: <span style="color: #191970;">(</span><span style="color: #8b2252;">"julien.montmartin@fastmail.fm"</span><span style="color: #191970;">)</span> -*-
</pre>
</div>
</div>
</div>
