emacs.el

:config (setq bm-cycle-all-buffers t)

:config (custom-set-faces
	   '(bm-face ((t (:background "#ffafff")))))

)

(last-step-duration "Bookmarks")

(c-set-offset (quote substatement-open) 0)

(setq auto-mode-alist (append '(("\.h$" . c++-mode)) auto-mode-alist))

(last-step-duration "C & C++")

(use-package cmake-mode

:config (setq auto-mode-alist
		(append '(("CMakeLists\\.txt\\'" . cmake-mode))
			'(("\\.cmake\\'" . cmake-mode))
			auto-mode-alist))

:config (add-hook 'cmake-mode-hook (lambda () (electric-indent-mode -1)))

)

(last-step-duration "CMake")

(use-package corfu
  ;; :init
  ;; (global-corfu-mode)
  :config
  ;; Complétion automatique après 0.2s
  (setq corfu-auto t)
  (setq corfu-auto-delay 0.2)
  (setq corfu-auto-prefix 2)

  ;; Cycle dans les candidats
  (setq corfu-cycle t)

  ;; Preview du candidat sélectionné
  (setq corfu-preview-current t)

  ;; Navigation avec Tab
  :bind (:map corfu-map
              ("TAB" . corfu-next)
              ("S-TAB" . corfu-previous)
              ("RET" . corfu-insert))

)

(use-package kind-icon
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(last-step-duration "Corfu")

(setq epa-file-encrypt-to "julien.montmartin@fastmail.fm")

(last-step-duration "EasyPG Assistant")
