emacs.org
* Ediff

Un mode très pratique pour gérer les diffs.

Les fichiers à comparer sont ouverts cote à cote, et non pas l'un en dessous de l'autre. On aurait presque envie de dire que la fenêtre est partagée verticalement, mais pour une obscure raison, la fonction concernée s'appelle au contraire ~split-window-horizontally~.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ediff-split-window-function 'split-window-horizontally)
#+END_SRC

Ediff n'ouvre pas de nouvelle fenêtre, tout se passe dans la fenêtre courante, en mode graphique comme en mode texte.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Ediff")
#+END_SRC

Reprend les raccourcis usuels d'Etags:

- {{{META-(.)}}} pour aller à la définition d'un symbole
- {{{META-(*)}}} pour revenir d'où on vient

Ctags, comme la plupart des autres outils d'indexation, ne fonctionne pas très bien avec C++, et nécessite en plus d'être configuré et périodiquement relancé... Il se trouve que ~helm-projectile-grep~ fonctionne tellement bien, que je n'utilise presque plus que ça pour naviguer dans les projets.

* Eglot

:Note:
Il faut les serveurs LSP

> sudo apt install clangd  # ou brew install llvm
> pip install python-lsp-server
> rustup component add rust-analyzer

Utilisation

M-. : Aller à la définition (natif Emacs, fonctionne avec eglot)
M-? : Trouver les références
C-c l a : Actions de code (refactor, import, etc.)
C-c l r : Renommer symbole
Complétion automatique avec company ou corfu

:End:

#+BEGIN_SRC emacs-lisp :tangle yes
      (use-package eglot
        :hook ((c-mode . eglot-ensure)
               (c++-mode . eglot-ensure)
               (python-mode . eglot-ensure)
               (rust-mode . eglot-ensure))
        :config
        ;; Désactive les messages verbeux
        (setq eglot-events-buffer-size 0)
        ;; Formate au save (optionnel)
        (add-hook 'before-save-hook
                  (lambda ()
                    (when (eglot-managed-p)
                      (eglot-format-buffer))))
        :bind (:map eglot-mode-map
                    ("C-c l a" . eglot-code-actions)
                    ("C-c l r" . eglot-rename)
                    ("C-c l f" . eglot-format)
                    ("C-c l d" . eldoc-doc-buffer))

#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
        )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Eglot")
#+END_SRC

* Graphviz

Mode majeur pour éditer les fichiers Graphviz, outil très pratique pour dessiner des graphes ou des diagrammes de classe. S'intègre très bien à [[*Org]], ce qui ne gâche rien !

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package graphviz-dot-mode
#+END_SRC

Pour effectuer un rendu depuis Emacs avec {{{CTRL-(c)}}} {{{KBD-(v)}}}

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (define-key graphviz-dot-mode-map (kbd "C-c v") 'graphviz-dot-preview)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Graphviz")
#+END_SRC

