emacs.html
<div id="outline-container-org3c6c451" class="outline-2">
<h2 id="org3c6c451">Ediff</h2>
<div class="outline-text-2" id="text-org3c6c451">
<p>
Un mode très pratique pour gérer les diffs.
</p>

<p>
Les fichiers à comparer sont ouverts cote à cote, et non pas l'un en dessous de l'autre. On aurait presque envie de dire que la fenêtre est partagée verticalement, mais pour une obscure raison, la fonction concernée s'appelle au contraire <code>split-window-horizontally</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> ediff-split-window-function 'split-window-horizontally<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Ediff n'ouvre pas de nouvelle fenêtre, tout se passe dans la fenêtre courante, en mode graphique comme en mode texte.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> ediff-window-setup-function 'ediff-setup-windows-plain<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Reprend les raccourcis usuels d'Etags:
</p>

<ul class="org-ul">
<li><kbd>M</kbd>-<kbd>.</kbd>pour aller à la définition d'un symbole</li>
<li><kbd>M</kbd>-<kbd>*</kbd>pour revenir d'où on vient</li>
</ul>

<p>
Ctags, comme la plupart des autres outils d'indexation, ne fonctionne pas très bien avec C++, et nécessite en plus d'être configuré et périodiquement relancé&#x2026; Il se trouve que <code>helm-projectile-grep</code> fonctionne tellement bien, que je n'utilise presque plus que ça pour naviguer dans les projets.
</p>
</div>
</div>
<div id="outline-container-orgce3a143" class="outline-2">
<h2 id="orgce3a143">Eglot</h2>
<div class="outline-text-2" id="text-orgce3a143">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> eglot
  <span style="color: #483d8b;">:hook</span> <span style="color: #0000ff;">(</span><span style="color: #a0522d;">(</span>c-mode . eglot-ensure<span style="color: #a0522d;">)</span>
         <span style="color: #a0522d;">(</span>c++-mode . eglot-ensure<span style="color: #a0522d;">)</span>
         <span style="color: #a0522d;">(</span>python-mode . eglot-ensure<span style="color: #a0522d;">)</span>
         <span style="color: #a0522d;">(</span>rust-mode . eglot-ensure<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
  <span style="color: #483d8b;">:config</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">D&#233;sactive les messages verbeux
</span>  <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> eglot-events-buffer-size 0<span style="color: #0000ff;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Formate au save (optionnel)
</span>  <span style="color: #0000ff;">(</span>add-hook 'before-save-hook
            <span style="color: #a0522d;">(</span><span style="color: #800080;">lambda</span> <span style="color: #800080;">()</span>
              <span style="color: #800080;">(</span><span style="color: #800080;">when</span> <span style="color: #b22222;">(</span>eglot-managed-p<span style="color: #b22222;">)</span>
                <span style="color: #b22222;">(</span>eglot-format-buffer<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
  <span style="color: #483d8b;">:bind</span> <span style="color: #0000ff;">(</span><span style="color: #483d8b;">:map</span> eglot-mode-map
              <span style="color: #a0522d;">(</span><span style="color: #8b2252;">"C-c l a"</span> . eglot-code-actions<span style="color: #a0522d;">)</span>
              <span style="color: #a0522d;">(</span><span style="color: #8b2252;">"C-c l r"</span> . eglot-rename<span style="color: #a0522d;">)</span>
              <span style="color: #a0522d;">(</span><span style="color: #8b2252;">"C-c l f"</span> . eglot-format<span style="color: #a0522d;">)</span>
              <span style="color: #a0522d;">(</span><span style="color: #8b2252;">"C-c l d"</span> . eldoc-doc-buffer<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgab17f15" class="outline-2">
<h2 id="orgab17f15">Graphviz</h2>
<div class="outline-text-2" id="text-orgab17f15">
<p>
Mode majeur pour éditer les fichiers Graphviz, outil très pratique pour dessiner des graphes ou des diagrammes de classe. S'intègre très bien à <a href="#org935ab7a">Org</a>, ce qui ne gâche rien !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> graphviz-dot-mode
</pre>
</div>

<p>
Pour effectuer un rendu depuis Emacs avec <kbd>C</kbd>-<kbd>c</kbd><kbd>v</kbd>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>define-key graphviz-dot-mode-map <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-c v"</span><span style="color: #0000ff;">)</span> 'graphviz-dot-preview<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
