emacs.el

(setq ediff-split-window-function 'split-window-horizontally)

(setq ediff-window-setup-function 'ediff-setup-windows-plain)

(last-step-duration "Ediff")

(use-package eglot
  :hook ((c-mode . eglot-ensure)
         (c++-mode . eglot-ensure)
         (python-mode . eglot-ensure)
         (rust-mode . eglot-ensure))
  :config
  ;; Désactive les messages verbeux
  (setq eglot-events-buffer-size 0)
  ;; Formate au save (optionnel)
  (add-hook 'before-save-hook
            (lambda ()
              (when (eglot-managed-p)
                (eglot-format-buffer))))
  :bind (:map eglot-mode-map
              ("C-c l a" . eglot-code-actions)
              ("C-c l r" . eglot-rename)
              ("C-c l f" . eglot-format)
              ("C-c l d" . eldoc-doc-buffer))

)

(last-step-duration "Eglot")

(use-package graphviz-dot-mode

:config (define-key graphviz-dot-mode-map (kbd "C-c v") 'graphviz-dot-preview)

)

(last-step-duration "Graphviz")

(use-package helm
