emacs.org
* Helm

[[https://github.com/emacs-helm/helm/wiki][Helm]] - Un framework plus qu'un simple module, de suggestion et d'aide à la sélection. S'appliquera bientôt à tous les aspects d'Emacs. Beaucoup plus intrusif que son principal concurrent, [[https://www.emacswiki.org/emacs/InteractivelyDoThings][Ido]], il change radicalement l'expérience utilisateur, et j'ai mis du temps à sauter le pas. Si ce n'est pas déjà fait, je vous encourage à faire de même ! En plus du nombre incroyable de fonctionnalités simplifiées, enrichies et unifiées, Helm favorise la découverte et l'exploration d'Emacs. Que du bon en fin de compte !

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package helm
#+END_SRC

Préfixe pour les commandes Helm, remplace {{{CTRL-(x)}}} {{{KBD-(c)}}} (à faire avant que Helm ne soit chargé)

#+BEGIN_SRC emacs-lisp :tangle yes
  :init (global-set-key (kbd "C-c h") 'helm-command-prefix)
  :init (global-unset-key (kbd "C-x c"))
#+END_SRC

Le traditionnel {{{META-(x)}}} appelle la version Helm de ~execute-extended-command~. Beaucoup de raccourcis appellent des commandes ainsi redéfinies. En particulier :

- {{{CTRL-(x)}}} {{{CTRL-(f)}}} permet parcourir et sélectionner les fichiers avec ~helm-find-files~
- {{{CTRL-(x)}}} {{{KBD-(r)}}} {{{KBD-(b)}}} permet de parcourir et sélectionner ses marque-pages avec ~helm-filtered-bookmarks~

#+BEGIN_SRC emacs-lisp :tangle yes
  :bind ("M-x" . helm-M-x)
  :bind ("C-x C-f" . helm-find-files)
  :bind ("C-x r b" . helm-filtered-bookmarks)
#+END_SRC

 {{{CTRL-(x)}}} {{{KBD-(b)}}} utilise la version Helm de ~switch-to-buffer~, beaucoup plus pratique que l'originale !

#+BEGIN_SRC emacs-lisp :tangle yes
  :bind ("C-x b" . helm-mini)
#+END_SRC

Dans un buffer Helm, {{{KBD-(TAB)}}} essaye de compléter ce qui peut l'être

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)
#+END_SRC

Pour lister les actions, à la place de {{{KBD-(TAB)}}}

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (define-key helm-map (kbd "C-z") 'helm-select-action)
#+END_SRC

Dans un chemin, sélectionne immédiatement un répertoire dès lors qu'il est le seul à correspondre à la saisie

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq helm-ff-auto-update-initial-value t)
#+END_SRC

S'il est disponible, on utilise cURL pour télécharger des données

#+BEGIN_SRC emacs-lisp :tangle yes
  :init (when (executable-find "curl")
	  (setq helm-net-prefer-curl t))
#+END_SRC

Ouvre le buffer Helm en partageant le buffer courant (partage horizontal)

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq helm-split-window-in-side-p t)
#+END_SRC

Quand on arrive à la fin des candidats, on boucle et on retourne au début

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq helm-move-to-line-cycle-in-source t)
#+END_SRC

Une couleur plus discrète pour les répertoires ~.~ et ~..~. La couleur par défaut est trop foncée : Elle donne l'impression qu'ils sont toujours sélectionnés quand on préfèrerait au contraire moins les voir.

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (custom-set-faces
	   '(helm-ff-dotted-directory ((t (:foreground "DimGrey")))))
#+END_SRC

Suggestion de la [[https://emacs-helm.github.io/helm/][doc]], Helm utilise le style de complétion _flex_. A creuser et à personaliser !

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq completion-styles '(flex))
#+END_SRC

La doc n'est pas claire, ~helm-mode~ activerait la completion Helm /partout/. De loin c'est bien ce qu'on veut... Mais la différence avec/sans n'est pas manifeste.

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (helm-mode 1))
#+END_SRC

Pour plus de lecture, voir cette introduction à Helm : [[http://tuhdo.github.io/helm-intro.html][A Package in a league of its own]].

:NOTE:
Creuser les nombreux paquets indiqués par la doc !
:END:

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Helm")
#+END_SRC

* Htmlize

Ce paquet définit ~htmlize-buffer~, qui permet d'exporter un buffer en HTML, tout en respectant la mise en évidence de syntaxe réalisée par Emacs. Simple et efficace, même si [[*Org]], avec ses blocs ~#+BEGIN_SRC~ et ~#+END_SRC~, offre souvent une bonne alternative.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package htmlize)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Htmlize")
#+END_SRC

* Idle HighLight Mode

Après un petit temps d'inactivité, surligne toutes les occurrences du mot se trouvant sous le curseur. Notepad++ fait cela par défaut. Très pratique pour voir où un symbole est utilisé, et repérer les fautes de frappe.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package idle-highlight-mode
#+END_SRC

Ce mode mineur est activé dans tous les modes de développement.

#+BEGIN_SRC emacs-lisp :tangle yes
  :hook (prog-mode . idle-highlight-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Idle HighLight Mode")
#+END_SRC

