emacs.html
<div id="outline-container-org1a31960" class="outline-2">
<h2 id="org1a31960">Helm</h2>
<div class="outline-text-2" id="text-org1a31960">
<p>
<a href="https://github.com/emacs-helm/helm/wiki">Helm</a> - Un framework plus qu'un simple module, de suggestion et d'aide à la sélection. S'appliquera bientôt à tous les aspects d'Emacs. Beaucoup plus intrusif que son principal concurrent, <a href="https://www.emacswiki.org/emacs/InteractivelyDoThings">Ido</a>, il change radicalement l'expérience utilisateur, et j'ai mis du temps à sauter le pas. Si ce n'est pas déjà fait, je vous encourage à faire de même ! En plus du nombre incroyable de fonctionnalités simplifiées, enrichies et unifiées, Helm favorise la découverte et l'exploration d'Emacs. Que du bon en fin de compte !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> helm
</pre>
</div>

<p>
Préfixe pour les commandes Helm, remplace <kbd>C</kbd>-<kbd>x</kbd><kbd>c</kbd>(à faire avant que Helm ne soit chargé)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:init</span> <span style="color: #191970;">(</span>global-set-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-c h"</span><span style="color: #0000ff;">)</span> 'helm-command-prefix<span style="color: #191970;">)</span>
<span style="color: #483d8b;">:init</span> <span style="color: #191970;">(</span>global-unset-key <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-x c"</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Le traditionnel <kbd>M</kbd>-<kbd>x</kbd>appelle la version Helm de <code>execute-extended-command</code>. Beaucoup de raccourcis appellent des commandes ainsi redéfinies. En particulier :
</p>

<ul class="org-ul">
<li><kbd>C</kbd>-<kbd>x</kbd><kbd>C</kbd>-<kbd>f</kbd>permet parcourir et sélectionner les fichiers avec <code>helm-find-files</code></li>
<li><kbd>C</kbd>-<kbd>x</kbd><kbd>r</kbd><kbd>b</kbd>permet de parcourir et sélectionner ses marque-pages avec <code>helm-filtered-bookmarks</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"M-x"</span> . helm-M-x<span style="color: #191970;">)</span>
<span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"C-x C-f"</span> . helm-find-files<span style="color: #191970;">)</span>
<span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"C-x r b"</span> . helm-filtered-bookmarks<span style="color: #191970;">)</span>
</pre>
</div>

<p>
<kbd>C</kbd>-<kbd>x</kbd><kbd>b</kbd>utilise la version Helm de <code>switch-to-buffer</code>, beaucoup plus pratique que l'originale !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"C-x b"</span> . helm-mini<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Dans un buffer Helm, <kbd>TAB</kbd>essaye de compléter ce qui peut l'être
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>define-key helm-map <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"&lt;tab&gt;"</span><span style="color: #0000ff;">)</span> 'helm-execute-persistent-action<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Pour lister les actions, à la place de <kbd>TAB</kbd>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>define-key helm-map <span style="color: #0000ff;">(</span>kbd <span style="color: #8b2252;">"C-z"</span><span style="color: #0000ff;">)</span> 'helm-select-action<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Dans un chemin, sélectionne immédiatement un répertoire dès lors qu'il est le seul à correspondre à la saisie
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> helm-ff-auto-update-initial-value t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
S'il est disponible, on utilise cURL pour télécharger des données
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:init</span> <span style="color: #191970;">(</span><span style="color: #800080;">when</span> <span style="color: #0000ff;">(</span>executable-find <span style="color: #8b2252;">"curl"</span><span style="color: #0000ff;">)</span>
      <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> helm-net-prefer-curl t<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Ouvre le buffer Helm en partageant le buffer courant (partage horizontal)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> helm-split-window-in-side-p t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Quand on arrive à la fin des candidats, on boucle et on retourne au début
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> helm-move-to-line-cycle-in-source t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Une couleur plus discrète pour les répertoires <code>.</code> et <code>..</code>. La couleur par défaut est trop foncée : Elle donne l'impression qu'ils sont toujours sélectionnés quand on préfèrerait au contraire moins les voir.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>custom-set-faces
       '<span style="color: #0000ff;">(</span>helm-ff-dotted-directory <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>t <span style="color: #b22222;">(</span><span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #696969;">DimGrey</span><span style="color: #8b2252;">"</span><span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Suggestion de la <a href="https://emacs-helm.github.io/helm/">doc</a>, Helm utilise le style de complétion <span class="underline">flex</span>. A creuser et à personaliser !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> completion-styles '<span style="color: #0000ff;">(</span>flex<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
La doc n'est pas claire, <code>helm-mode</code> activerait la completion Helm <i>partout</i>. De loin c'est bien ce qu'on veut&#x2026; Mais la différence avec/sans n'est pas manifeste.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>helm-mode 1<span style="color: #191970;">)</span><span style="color: #000000; background-color: #ff8f88;">)</span>
</pre>
</div>

<p>
Pour plus de lecture, voir cette introduction à Helm : <a href="http://tuhdo.github.io/helm-intro.html">A Package in a league of its own</a>.
</p>
</div>
</div>
<div id="outline-container-org5d1e2b8" class="outline-2">
<h2 id="org5d1e2b8">Htmlize</h2>
<div class="outline-text-2" id="text-org5d1e2b8">
<p>
Ce paquet définit <code>htmlize-buffer</code>, qui permet d'exporter un buffer en HTML, tout en respectant la mise en évidence de syntaxe réalisée par Emacs. Simple et efficace, même si <a href="#org935ab7a">Org</a>, avec ses blocs <code>#+BEGIN_SRC</code> et <code>#+END_SRC</code>, offre souvent une bonne alternative.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> htmlize<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf26343c" class="outline-2">
<h2 id="orgf26343c">Idle HighLight Mode</h2>
<div class="outline-text-2" id="text-orgf26343c">
<p>
Après un petit temps d'inactivité, surligne toutes les occurrences du mot se trouvant sous le curseur. Notepad++ fait cela par défaut. Très pratique pour voir où un symbole est utilisé, et repérer les fautes de frappe.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> idle-highlight-mode
</pre>
</div>

<p>
Ce mode mineur est activé dans tous les modes de développement.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:hook</span> <span style="color: #191970;">(</span>prog-mode . idle-highlight-mode<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
