emacs.el

:init (global-set-key (kbd "C-c h") 'helm-command-prefix)
:init (global-unset-key (kbd "C-x c"))

:bind ("M-x" . helm-M-x)
:bind ("C-x C-f" . helm-find-files)
:bind ("C-x r b" . helm-filtered-bookmarks)

:bind ("C-x b" . helm-mini)

:config (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)

:config (define-key helm-map (kbd "C-z") 'helm-select-action)

:config (setq helm-ff-auto-update-initial-value t)

:init (when (executable-find "curl")
	  (setq helm-net-prefer-curl t))

:config (setq helm-split-window-in-side-p t)

:config (setq helm-move-to-line-cycle-in-source t)

:config (custom-set-faces
	   '(helm-ff-dotted-directory ((t (:foreground "DimGrey")))))

:config (setq completion-styles '(flex))

:config (helm-mode 1))

(last-step-duration "Helm")

(use-package htmlize)

(last-step-duration "Htmlize")

(use-package idle-highlight-mode

:hook (prog-mode . idle-highlight-mode)

)

(last-step-duration "Idle HighLight Mode")
