emacs.org
* Lisp

Dans les contextes où il y a du Lisp, on affiche les éventuelles informations disponibles sur une fonction ou une variable dans la zone d'écho, c.à.d à l'emplacement du minibuffer.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
  (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
  (add-hook 'ielm-mode-hook 'eldoc-mode)
#+END_SRC

IELM est un mode assez utile pour tester des petits bouts de Lisp. Il s'agit d'un Read-Eval-Print-Loop comme en ont la plupart des langages interprétés. Une très courte introduction dans ce billet [[http://emacs-fu.blogspot.fr/2011/03/ielm-repl-for-emacs.html][IELM: a REPL for emacs]].

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Lisp")
#+END_SRC

* Magit

:NOTE:
Pour éviter l'erreur suivante (qui paralyse Emacs !), on ne charge Magit que si git est présent...
Error in post-command-hook (magit-auto-revert-mode-check-buffers): (file-error "Searching for program" "Aucun fichier ou dossier de ce type" "git")
:END:

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (if (executable-find "git")
      (progn (when
#+END_SRC

Un module exceptionnel, à essayer absolument si vous êtes utilisateur de Git et d'Emacs !

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package magit
#+END_SRC

La plupart des opérations dans Magit commencent par le buffer ~status~ accessible par le raccourci {{{CTRL-(x)}}} {{{KBD-(g)}}}.

#+BEGIN_SRC emacs-lisp :tangle yes
  :bind ("C-x g" . magit-status)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  ))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Magit")
#+END_SRC

* MMM Mode

Permet de faire cohabiter plusieurs modes majeurs dans un même buffer.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package mmm-mode
#+END_SRC

Reparse un buffer qui a été modifié dès qu'Emacs a un peu de temps

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq mmm-parse-when-idle t)
#+END_SRC

Ce mode n'est pas activé automatiquement, mais uniquement dans les buffer pour lesquels on va définir une règle de sous mode

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq mmm-global-mode 'sometimes)
#+END_SRC

Définit la règle here-doc qui active le mode ~shell-script-mode~ entre les motifs ~<<EOF~ et ~^EOF~, qui délimitent habituellement un /here document/

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (mmm-add-classes
	   '((here-doc
	      :submode shell-script-mode
	      :front "<<EOF"
	      :back "^EOF")))
#+END_SRC

La règle here-doc est activée dans les buffers qui sont dans le très élémentaire mode ~text-mode~ (sans critère d'extension)

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (mmm-add-mode-ext-class 'text-mode nil 'here-doc)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "MMM Mode")
#+END_SRC

* Org

Un autre mode exceptionnel. Au départ un /outliner/, puis un outil de publication avec environnement de /literate programming/, mais aussi de GTD, de suivi de temps, un agenda, etc.

Les lignes ne sont pas tronquées. Plus pratique comme ça, tant pis pour les tableaux !

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-startup-truncated nil)
#+END_SRC

Les lignes sont indentées selon leur profondeur dans l'arborescence

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-startup-indented t)
#+END_SRC

Dans les blocs de code, on veut la mise en évidence de syntaxe, et l'on utilise la touche {{{KBD-(TAB)}}} pour indenter (et non pour insérer une tabulation)

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-src-fontify-natively t)
  (setq org-src-tab-acts-natively t)
#+END_SRC

Les blocs de code sont évalués sans demande de confirmation, ainsi que les liens spéciaux qui exécutent du shell ou du Lisp

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-confirm-babel-evaluate nil)
  (setq org-confirm-shell-link-function nil)
  (setq org-confirm-elisp-link-function nil)
#+END_SRC

Sauf indication contraire, les éléments de texte générés par Org sont en français

#+Begin_SRC emacs-lisp :tangle yes
  (setq org-export-default-language "fr")
#+END_SRC

Concernant l'export (en HTML par exemple) :
- On ne veut pas que les titres des sections soient numérotés
- Au-delà de trois niveaux de titres, on préfère des listes
- On ne veut pas d'auteur (valorisé par Org avec le nom de l'utilisateur)

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-export-with-section-numbers nil)
  (setq org-export-headline-levels 3)
  (setq org-export-with-author nil)
#+END_SRC

** Mise à jour

La dernière version d'Org n'est en général pas celle qui est livrée avec Emacs. Il faut la mettre à jour avec le gestionnaire de paquets. Pour une raison que j'ignore, Org n'est pas listé comme /built-in/, mais quand on l'installe manuellement, le gestionnaire de paquet indique bien "shadowing a built-in package".

Ensuite, en cas de bug suspect, il se peut qu'il faille supprimer les fichiers lisp précompilés se trouvant dans ~~/.emacs.d/elpa/org-x.y.z~, relancer Emacs, puis les générer à nouveau avec ~byte-recompile-directory~.

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Org Mode")
#+END_SRC

