emacs.html
<div id="outline-container-orgd4447cf" class="outline-2">
<h2 id="orgd4447cf">Lisp</h2>
<div class="outline-text-2" id="text-orgd4447cf">
<p>
Dans les contextes où il y a du Lisp, on affiche les éventuelles informations disponibles sur une fonction ou une variable dans la zone d'écho, c.à.d à l'emplacement du minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-hook 'emacs-lisp-mode-hook 'eldoc-mode<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>add-hook 'lisp-interaction-mode-hook 'eldoc-mode<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span>add-hook 'ielm-mode-hook 'eldoc-mode<span style="color: #191970;">)</span>
</pre>
</div>

<p>
IELM est un mode assez utile pour tester des petits bouts de Lisp. Il s'agit d'un Read-Eval-Print-Loop comme en ont la plupart des langages interprétés. Une très courte introduction dans ce billet <a href="http://emacs-fu.blogspot.fr/2011/03/ielm-repl-for-emacs.html">IELM: a REPL for emacs</a>.
</p>
</div>
</div>
<div id="outline-container-org4b067b9" class="outline-2">
<h2 id="org4b067b9">Magit</h2>
<div class="outline-text-2" id="text-org4b067b9">
<p>
Un module exceptionnel, à essayer absolument si vous êtes utilisateur de Git et d'Emacs !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> magit
</pre>
</div>

<p>
La plupart des opérations dans Magit commencent par le buffer <code>status</code> accessible par le raccourci <kbd>C</kbd>-<kbd>x</kbd><kbd>g</kbd>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"C-x g"</span> . magit-status<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa7972f" class="outline-2">
<h2 id="orgaa7972f">MMM Mode</h2>
<div class="outline-text-2" id="text-orgaa7972f">
<p>
Permet de faire cohabiter plusieurs modes majeurs dans un même buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> mmm-mode
</pre>
</div>

<p>
Reparse un buffer qui a été modifié dès qu'Emacs a un peu de temps
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> mmm-parse-when-idle t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Ce mode n'est pas activé automatiquement, mais uniquement dans les buffer pour lesquels on va définir une règle de sous mode
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> mmm-global-mode 'sometimes<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Définit la règle here-doc qui active le mode <code>shell-script-mode</code> entre les motifs <code>&lt;&lt;EOF</code> et <code>^EOF</code>, qui délimitent habituellement un <i>here document</i>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>mmm-add-classes
       '<span style="color: #0000ff;">(</span><span style="color: #a0522d;">(</span>here-doc
          <span style="color: #483d8b;">:submode</span> shell-script-mode
          <span style="color: #483d8b;">:front</span> <span style="color: #8b2252;">"&lt;&lt;EOF"</span>
          <span style="color: #483d8b;">:back</span> <span style="color: #8b2252;">"^EOF"</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
La règle here-doc est activée dans les buffers qui sont dans le très élémentaire mode <code>text-mode</code> (sans critère d'extension)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>mmm-add-mode-ext-class 'text-mode nil 'here-doc<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org935ab7a" class="outline-2">
<h2 id="org935ab7a">Org</h2>
<div class="outline-text-2" id="text-org935ab7a">
<p>
Un autre mode exceptionnel. Au départ un <i>outliner</i>, puis un outil de publication avec environnement de <i>literate programming</i>, mais aussi de GTD, de suivi de temps, un agenda, etc.
</p>

<p>
Les lignes ne sont pas tronquées. Plus pratique comme ça, tant pis pour les tableaux !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-startup-truncated nil<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Les lignes sont indentées selon leur profondeur dans l'arborescence
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-startup-indented t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Dans les blocs de code, on veut la mise en évidence de syntaxe, et l'on utilise la touche <kbd>TAB</kbd>pour indenter (et non pour insérer une tabulation)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-src-fontify-natively t<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-src-tab-acts-natively t<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Les blocs de code sont évalués sans demande de confirmation, ainsi que les liens spéciaux qui exécutent du shell ou du Lisp
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-confirm-babel-evaluate nil<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-confirm-shell-link-function nil<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-confirm-elisp-link-function nil<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Sauf indication contraire, les éléments de texte générés par Org sont en français
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-export-default-language <span style="color: #8b2252;">"fr"</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Concernant l'export (en HTML par exemple) :
</p>
<ul class="org-ul">
<li>On ne veut pas que les titres des sections soient numérotés</li>
<li>Au-delà de trois niveaux de titres, on préfère des listes</li>
<li>On ne veut pas d'auteur (valorisé par Org avec le nom de l'utilisateur)</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-export-with-section-numbers nil<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-export-headline-levels 3<span style="color: #191970;">)</span>
<span style="color: #191970;">(</span><span style="color: #800080;">setq</span> org-export-with-author nil<span style="color: #191970;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgd2e7c2e" class="outline-3">
<h3 id="orgd2e7c2e">Mise à jour</h3>
<div class="outline-text-3" id="text-orgd2e7c2e">
<p>
La dernière version d'Org n'est en général pas celle qui est livrée avec Emacs. Il faut la mettre à jour avec le gestionnaire de paquets. Pour une raison que j'ignore, Org n'est pas listé comme <i>built-in</i>, mais quand on l'installe manuellement, le gestionnaire de paquet indique bien "shadowing a built-in package".
</p>

<p>
Ensuite, en cas de bug suspect, il se peut qu'il faille supprimer les fichiers lisp précompilés se trouvant dans <code>~/.emacs.d/elpa/org-x.y.z</code>, relancer Emacs, puis les générer à nouveau avec <code>byte-recompile-directory</code>.
</p>
</div>
</div>
</div>
