emacs.el

(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
(add-hook 'ielm-mode-hook 'eldoc-mode)

(last-step-duration "Lisp")

(if (executable-find "git")
    (progn (when

(use-package magit

:bind ("C-x g" . magit-status)

))))

(last-step-duration "Magit")

(use-package mmm-mode

:config (setq mmm-parse-when-idle t)

:config (setq mmm-global-mode 'sometimes)

:config (mmm-add-classes
	   '((here-doc
	      :submode shell-script-mode
	      :front "<<EOF"
	      :back "^EOF")))

:config (mmm-add-mode-ext-class 'text-mode nil 'here-doc)

)

(last-step-duration "MMM Mode")

(setq org-startup-truncated nil)

(setq org-startup-indented t)

(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)

(setq org-confirm-babel-evaluate nil)
(setq org-confirm-shell-link-function nil)
(setq org-confirm-elisp-link-function nil)

(setq org-export-default-language "fr")

(setq org-export-with-section-numbers nil)
(setq org-export-headline-levels 3)
(setq org-export-with-author nil)

(last-step-duration "Org Mode")

(add-hook 'prog-mode-hook
	    (lambda ()
