emacs.org
* Prettify Symbols

~prettify-symbols-mode~ permet de remplacer certaines séquences par un caractère composé (ou de faire des ligatures, pour reprendre la terminologie d'autres éditeurs). Par exemple, lorsqu'on écrit ~a<=b~, Emacs affiche ~a≤b~. Les séquences à /enjoliver/ sont définies par la liste ~prettify-symbols-alist~, que chaque mode majeur est susceptible d'enrichir. Dans la pratique toutefois, elle semble vide la plupart du temps. Voici donc quelques ajouts  faits au niveau de ~prog-mode~, dont tous les modes de développement dérivés profiteront.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'prog-mode-hook
	    (lambda ()
	      (push '("/=" . ?≠) prettify-symbols-alist)
	      (push '("!=" . ?≠) prettify-symbols-alist)
	      (push '("==" . ?⩵) prettify-symbols-alist)
	      (push '("&&" . ?∧) prettify-symbols-alist)
	      (push '("||" . ?∨) prettify-symbols-alist)
	      (push '("<=" . ?≤) prettify-symbols-alist)
	      (push '(">=" . ?≥) prettify-symbols-alist)
	      (push '("<<" . ?≪) prettify-symbols-alist)
	      (push '(">>" . ?≫) prettify-symbols-alist)
	      (push '("::" . ?∷) prettify-symbols-alist)
	      (push '("->" . ?→) prettify-symbols-alist)
	      (push '("=>" . ?⇒) prettify-symbols-alist)
	      (push '("and" . ?∧) prettify-symbols-alist)
	      (push '("not" . ?¬) prettify-symbols-alist)
	      (push '("or" . ?∨) prettify-symbols-alist)
	      ))
#+END_SRC

Pour fixer les idées, voici ce à quoi ça ressemble sur quelques lignes de C++

#+BEGIN_SRC C++ :tangle no
  void foo(std∷pair<int, int>* p)
  {
      //Print something if first != second
      if(p ≠ nullptr ∧ (p→first ≠ p→second))
	  std∷cout ≪ p→first « "!=" ≪ p→second « std∷endl;
  }
#+END_SRC

On note que les séquences ne sont pas remplacées dans les chaines de caractères ni dans les commentaires. Elles ne sont pas non plus exportées par [[*Org]] (j'ai modifié cet exemple à la main). Par ailleurs, la longueur des lignes reste correctement calculée, ce qui /facilite/ la cohabitation avec les paquets tels que ~display-fill-column-indicator-column~.

:NOTE:
Est-ce toujours d'actualité ?
Il reste quelques petits problèmes, comme une petite /marche/ sur la limite pour les lignes trop longues, mais avec ~fci-mode~, il faut savoir faire des compromis.
:END:

J'utilise Prettify Symbols depuis peu de temps, il est donc encore en phase de test. Pour l'instant, on l'active dans tous les modes qui le supportent.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-prettify-symbols-mode t)
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Prettify Symbols")
#+END_SRC

* Projectile

Un module qui fournit une fonctionnalité bien pratique : regrouper les fichiers d'un même projet. Lorsqu'on ouvre un fichier, Projectile cherche un dépôt (via la présence d'un ~.git~ ou autre) dans le répertoire du fichier ouvert, puis dans ses répertoires parents.

S'il identifie un dépôt, Projectile considère que tous les fichiers du dépôt font partie d'un même projet, et fournit des fonctions pour les traiter ensemble.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package projectile
#+END_SRC

Active Projectile dans tous les modes le supportant

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (projectile-mode +1)
#+END_SRC

Raccourci {{{CTRL-(t)}}} pour ~projectile-find-other-file~ qui ouvre un fichier associé : Si, par exemple, on est dans un buffer visitant ~foo.h~, Projectile cherche dans le projet ~foo.c~, et l'ouvre s'il le trouve. J'utilisais avant /Find File At Point/ pour cette fonctionnalité, mais je trouve maintenant Projectile plus efficace.

:NOTE:
- ne fonctionne pas sous Windows entre foo.org et foo.el ?
- est-ce à cause de (projectile-indexing-method 'alien) ?
- faut-il passer 't' à la fin pour le flex matching ?
:END:

#+BEGIN_SRC emacs-lisp :tangle yes
  :bind ("C-t" . projectile-find-other-file)
#+END_SRC

Projectile utilise Helm pour l'aide à la sélection

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq projectile-completion-system 'helm))
#+END_SRC

Active les raccourcis Helm pour les fonctions Projectile

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package helm-projectile
    :config (helm-projectile-on))
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Projectile")
#+END_SRC

