emacs.html
<div id="outline-container-orgdc04a5f" class="outline-2">
<h2 id="orgdc04a5f">Prettify Symbols</h2>
<div class="outline-text-2" id="text-orgdc04a5f">
<p>
<code>prettify-symbols-mode</code> permet de remplacer certaines séquences par un caractère composé (ou de faire des ligatures, pour reprendre la terminologie d'autres éditeurs). Par exemple, lorsqu'on écrit <code>a&lt;=b</code>, Emacs affiche <code>a≤b</code>. Les séquences à <i>enjoliver</i> sont définies par la liste <code>prettify-symbols-alist</code>, que chaque mode majeur est susceptible d'enrichir. Dans la pratique toutefois, elle semble vide la plupart du temps. Voici donc quelques ajouts  faits au niveau de <code>prog-mode</code>, dont tous les modes de développement dérivés profiteront.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-hook 'prog-mode-hook
        <span style="color: #0000ff;">(</span><span style="color: #800080;">lambda</span> <span style="color: #a0522d;">()</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"/="</span> . ?&#8800;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"!="</span> . ?&#8800;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"=="</span> . ?&#10869;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"&amp;&amp;"</span> . ?&#8743;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"||"</span> . ?&#8744;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"&lt;="</span> . ?&#8804;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"&gt;="</span> . ?&#8805;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"&lt;&lt;"</span> . ?&#8810;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"&gt;&gt;"</span> . ?&#8811;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"::"</span> . ?&#8759;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"-&gt;"</span> . ?&#8594;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"=&gt;"</span> . ?&#8658;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"and"</span> . ?&#8743;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"not"</span> . ?&#172;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span><span style="color: #800080;">push</span> '<span style="color: #800080;">(</span><span style="color: #8b2252;">"or"</span> . ?&#8744;<span style="color: #800080;">)</span> prettify-symbols-alist<span style="color: #a0522d;">)</span>
          <span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Pour fixer les idées, voici ce à quoi ça ressemble sur quelques lignes de C++
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">foo</span><span style="color: #191970;">(</span>std&#8759;<span style="color: #228b22;">pair</span><span style="color: #0000ff;">&lt;</span><span style="color: #228b22;">int</span>, <span style="color: #228b22;">int</span><span style="color: #0000ff;">&gt;</span>* p<span style="color: #191970;">)</span>
<span style="color: #191970;">{</span>
    <span style="color: #b22222;">//</span><span style="color: #b22222;">Print something if first != second
</span>    <span style="color: #800080;">if</span><span style="color: #0000ff;">(</span>p &#8800; <span style="color: #008b8b;">nullptr</span> &#8743; <span style="color: #a0522d;">(</span>p&#8594;first &#8800; p&#8594;second<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
      std&#8759;cout &#8810; p&#8594;first &#171; <span style="color: #8b2252;">"!="</span> &#8810; p&#8594;second &#171; std&#8759;endl;
<span style="color: #191970;">}</span>
</pre>
</div>

<p>
On note que les séquences ne sont pas remplacées dans les chaines de caractères ni dans les commentaires. Elles ne sont pas non plus exportées par <a href="#org935ab7a">Org</a> (j'ai modifié cet exemple à la main). Par ailleurs, la longueur des lignes reste correctement calculée, ce qui <i>facilite</i> la cohabitation avec les paquets tels que <code>display-fill-column-indicator-column</code>.
</p>

<p>
J'utilise Prettify Symbols depuis peu de temps, il est donc encore en phase de test. Pour l'instant, on l'active dans tous les modes qui le supportent.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>global-prettify-symbols-mode t<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfdf9eed" class="outline-2">
<h2 id="orgfdf9eed">Projectile</h2>
<div class="outline-text-2" id="text-orgfdf9eed">
<p>
Un module qui fournit une fonctionnalité bien pratique : regrouper les fichiers d'un même projet. Lorsqu'on ouvre un fichier, Projectile cherche un dépôt (via la présence d'un <code>.git</code> ou autre) dans le répertoire du fichier ouvert, puis dans ses répertoires parents.
</p>

<p>
S'il identifie un dépôt, Projectile considère que tous les fichiers du dépôt font partie d'un même projet, et fournit des fonctions pour les traiter ensemble.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> projectile
</pre>
</div>

<p>
Active Projectile dans tous les modes le supportant
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>projectile-mode +1<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Raccourci <kbd>C</kbd>-<kbd>t</kbd>pour <code>projectile-find-other-file</code> qui ouvre un fichier associé : Si, par exemple, on est dans un buffer visitant <code>foo.h</code>, Projectile cherche dans le projet <code>foo.c</code>, et l'ouvre s'il le trouve. J'utilisais avant <i>Find File At Point</i> pour cette fonctionnalité, mais je trouve maintenant Projectile plus efficace.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"C-t"</span> . projectile-find-other-file<span style="color: #191970;">)</span>
</pre>
</div>

<p>
Projectile utilise Helm pour l'aide à la sélection
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> projectile-completion-system 'helm<span style="color: #191970;">)</span><span style="color: #000000; background-color: #ff8f88;">)</span>
</pre>
</div>

<p>
Active les raccourcis Helm pour les fonctions Projectile
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> helm-projectile
  <span style="color: #483d8b;">:config</span> <span style="color: #0000ff;">(</span>helm-projectile-on<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
