emacs.org
* Rainbow delimiters

Met en évidence les symboles ouvrants et fermants, comme les parenthèses, les accolades ou les crochets, avec des couleurs appariées. Raffiné et élégant !

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package rainbow-delimiters
#+END_SRC

Exemple avec des parenthèses :

#+BEGIN_SRC emacs-lisp :tangle no
  (when (foo (bar (baz t))))
#+END_SRC

Active cette fonctionnalité dans tous les modes de développement

#+BEGIN_SRC emacs-lisp :tangle yes
  :hook (prog-mode . rainbow-delimiters-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Rainbow delimiters")
#+END_SRC

* Rainbow mode

Cherche dans un buffer les chaines représentant une couleur, et les surligne avec cette couleur. Quelquefois il devine mal et surligne des couleurs qui n'en sont pas, mais ça reste très pratique, et joli, ce qui ne gâche rien ! L'essayer c'est l'adopter.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package rainbow-mode
#+END_SRC

Quelques exemples de couleurs reconnues :

#+BEGIN_SRC emacs-lisp :tangle no
  (message "De la couleur ! #ffafff #F5DEB3 #def DeepPink")
#+END_SRC

Active cette fonctionnalité dans tous les modes de développement

#+BEGIN_SRC emacs-lisp :tangle yes
  :hook (prog-mode . rainbow-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Rainbow mode")
#+END_SRC

* Related

Package perso, disponible sur Melpa. Related simplifie les noms des buffers pour obtenir une base, et tous les buffers ayant la même base forment un groupe.

- {{{CTRL-(x)}}} {{{KBD-(↑)}}} appelle ~related-switch-forward~ et passe au prochain buffer du groupe
- {{{CTRL-(x)}}} {{{KBD-(↓)}}} appelle ~related-switch-backward~ et revient au précédent buffer du groupe

Related permet de naviguer facilement parmi des buffers qui vont ensemble. Par exemple si les trois fichiers suivants sont ouverts :

- ~/path/to/include/foo.h~
- ~/path/to/source/foo.c~
- ~/path/to/doc/foo.org~

On peut passer de l'un à l'autre avec {{{CTRL-(x)}}} {{{KBD-(↑)}}} : ~foo.h~ → ~foo.c~ → ~foo.org~ → ~foo.h~ etc.

:NOTE:
Faire fonctionner le SVG, réussir à ce que les caractères ne soient pas énormes, et correspondent au reste du document

#+BEGIN_SRC dot :file RelatedFooForward.png :cmdline -Kdot -Tpng
digraph RelatedFooForward {
	rankdir=LR;
	node [shape=box];
  graph [fontname="Courrier new" fontsize=8];
  node [fontname="Courrier new" fontsize=8];
  edge [fontname="Courrier new" fontsize=8];

	"foo.h" -> "foo.c" [label="C-x ↑"];
	"foo.c" -> "foo.org" [label="C-x ↑"];
	"foo.org" -> "foo.h" [label="C-x ↑"];
}
#+END_SRC
:END:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package related
#+END_SRC

Active Related, qui est un mode mineur global

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (related-mode)
#+END_SRC

{{{CTRL-(x)}}} {{{KBD-(END)}}} propose de choisir un buffer du groupe, en utilisant Helm, s'il est activé

#+BEGIN_SRC emacs-lisp :tangle yes
  :bind ("C-x <end>" . related-switch-buffer)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Related")
#+END_SRC

* Shell scripts

Les fichiers en ~.sh~ s'ouvrent avec ~shell-script-mode~, indépendamment de leur /shebang/. Pour une raison qui reste à déterminer, cette ligne ne fonctionne pas quand elle se trouve au début de ce fichier de configuration.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'auto-mode-alist '("\\.sh\\'" . sh-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Shell scripts")
#+END_SRC

* Souris

La molette de la souris fait défiler les lignes deux par deux

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq mouse-wheel-scroll-amount '(2))
#+END_SRC

Le défilement à l'écran suit la molette, et le pas reste constant quand elle accélère

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq mouse-wheel-progressive-speed nil)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Souris")
#+END_SRC

