emacs.html
<div id="outline-container-org998ae28" class="outline-2">
<h2 id="org998ae28">Rainbow delimiters</h2>
<div class="outline-text-2" id="text-org998ae28">
<p>
Met en évidence les symboles ouvrants et fermants, comme les parenthèses, les accolades ou les crochets, avec des couleurs appariées. Raffiné et élégant !
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> rainbow-delimiters
</pre>
</div>

<p>
Exemple avec des parenthèses :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">when</span> <span style="color: #0000ff;">(</span>foo <span style="color: #a0522d;">(</span>bar <span style="color: #800080;">(</span>baz t<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Active cette fonctionnalité dans tous les modes de développement
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:hook</span> <span style="color: #191970;">(</span>prog-mode . rainbow-delimiters-mode<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc45740" class="outline-2">
<h2 id="orgbc45740">Rainbow mode</h2>
<div class="outline-text-2" id="text-orgbc45740">
<p>
Cherche dans un buffer les chaines représentant une couleur, et les surligne avec cette couleur. Quelquefois il devine mal et surligne des couleurs qui n'en sont pas, mais ça reste très pratique, et joli, ce qui ne gâche rien ! L'essayer c'est l'adopter.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> rainbow-mode
</pre>
</div>

<p>
Quelques exemples de couleurs reconnues :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>message <span style="color: #8b2252;">"De la couleur ! </span><span style="color: #000000; background-color: #ffafff;">#ffafff</span><span style="color: #8b2252;"> </span><span style="color: #000000; background-color: #F5DEB3;">#F5DEB3</span><span style="color: #8b2252;"> </span><span style="color: #000000; background-color: #def;">#def</span><span style="color: #8b2252;"> </span><span style="color: #ffffff; background-color: #ff1493;">DeepPink</span><span style="color: #8b2252;">"</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Active cette fonctionnalité dans tous les modes de développement
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:hook</span> <span style="color: #191970;">(</span>prog-mode . rainbow-mode<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org76cc172" class="outline-2">
<h2 id="org76cc172">Related</h2>
<div class="outline-text-2" id="text-org76cc172">
<p>
Package perso, disponible sur Melpa. Related simplifie les noms des buffers pour obtenir une base, et tous les buffers ayant la même base forment un groupe.
</p>

<ul class="org-ul">
<li><kbd>C</kbd>-<kbd>x</kbd><kbd>↑</kbd>appelle <code>related-switch-forward</code> et passe au prochain buffer du groupe</li>
<li><kbd>C</kbd>-<kbd>x</kbd><kbd>↓</kbd>appelle <code>related-switch-backward</code> et revient au précédent buffer du groupe</li>
</ul>

<p>
Related permet de naviguer facilement parmi des buffers qui vont ensemble. Par exemple si les trois fichiers suivants sont ouverts :
</p>

<ul class="org-ul">
<li><code>/path/to/include/foo.h</code></li>
<li><code>/path/to/source/foo.c</code></li>
<li><code>/path/to/doc/foo.org</code></li>
</ul>

<p>
On peut passer de l'un à l'autre avec <kbd>C</kbd>-<kbd>x</kbd><kbd>↑</kbd>: <code>foo.h</code> → <code>foo.c</code> → <code>foo.org</code> → <code>foo.h</code> etc.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> related
</pre>
</div>

<p>
Active Related, qui est un mode mineur global
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>related-mode<span style="color: #191970;">)</span>
</pre>
</div>

<p>
<kbd>C</kbd>-<kbd>x</kbd><kbd>END</kbd>propose de choisir un buffer du groupe, en utilisant Helm, s'il est activé
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"C-x &lt;end&gt;"</span> . related-switch-buffer<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d1d42a" class="outline-2">
<h2 id="org9d1d42a">Shell scripts</h2>
<div class="outline-text-2" id="text-org9d1d42a">
<p>
Les fichiers en <code>.sh</code> s'ouvrent avec <code>shell-script-mode</code>, indépendamment de leur <i>shebang</i>. Pour une raison qui reste à déterminer, cette ligne ne fonctionne pas quand elle se trouve au début de ce fichier de configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-to-list 'auto-mode-alist '<span style="color: #0000ff;">(</span><span style="color: #8b2252;">"\\.sh\\'"</span> . sh-mode<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org086dec8" class="outline-2">
<h2 id="org086dec8">Souris</h2>
<div class="outline-text-2" id="text-org086dec8">
<p>
La molette de la souris fait défiler les lignes deux par deux
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> mouse-wheel-scroll-amount '<span style="color: #0000ff;">(</span>2<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Le défilement à l'écran suit la molette, et le pas reste constant quand elle accélère
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> mouse-wheel-progressive-speed nil<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
