emacs.el

:hook (prog-mode . rainbow-delimiters-mode)

)

(last-step-duration "Rainbow delimiters")

(use-package rainbow-mode

:hook (prog-mode . rainbow-mode)

)

(last-step-duration "Rainbow mode")

(use-package related

:config (related-mode)

:bind ("C-x <end>" . related-switch-buffer)

)

(last-step-duration "Related")

(add-to-list 'auto-mode-alist '("\\.sh\\'" . sh-mode))

(last-step-duration "Shell scripts")

(setq mouse-wheel-scroll-amount '(2))

(setq mouse-wheel-progressive-speed nil)

(last-step-duration "Souris")
