emacs.org
* TabTab minor mode

Change le comportement de la touche {{{KBD-(TAB)}}} :
- {{{KBD-(TAB)}}} ne sert plus à indenter la ligne, mais aligne le texte sur le prochain arrêt de tabulation
- {{{SHIFT-(TAB)}}} remplit la fonction opposée, et aligne le texte sur l'arrêt de tabulation précédent

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun prev-tab-to-tab-stop ()
    "Remove spaces or tabs to next defined tab-stop column."
    (interactive)
    (and abbrev-mode (= (char-syntax (preceding-char)) ?w)
	 (expand-abbrev))
    (let ((nexttab (indent-next-tab-stop (current-column) t)))
      (delete-horizontal-space t)
      (indent-to nexttab)))

  (define-minor-mode tab-tab-mode
    "Tab-to-tab in both directions"
    :lighter " TTm"
    :keymap (let ((map (make-sparse-keymap)))
	      (define-key map (kbd "<tab>") 'tab-to-tab-stop)
	      (define-key map (kbd "S-<tab>") 'prev-tab-to-tab-stop)
	      map))
#+END_SRC

Écrit initialement pour ~cmake-mode~. Le mode majeur doit prendre en compte la /key-map/. On active ~tab-tab-mode~ avec un hook

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'cmake-mode-hook 'tab-tab-mode)
#+END_SRC

On peut aussi se contenter d'un ~local-set-key~

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'cmake-mode-hook (local-set-key (kbd "<tab>") 'tab-to-tab-stop))
#+END_SRC

 Voir [[http://nullprogram.com/blog/2013/02/06][How to Make an Emacs Minor Mode]] pour un tutoriel clair et bien fait.

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
    (last-step-duration "TabTab minor mode")
#+END_SRC

* Tcl

Ouvre les ~.tm~ comme des modules Tcl

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq auto-mode-alist (append '(("\.tm$" . tcl-mode)) auto-mode-alist))
#+END_SRC

* Thèmes


Les couleurs par défaut d'Emacs ne fonctionnent pas toujours bien lorsqu'il est lancé en mode texte dans un terminal en mode sombre : Les couleurs ne ressortent pas. Pour régler le problème, il faut utiliser un terminal qui supporte le mode ~truecolor~, comme [[https://iterm2.com/][iTerm2]].

** Thème standard

Le thème par défaut n'en est pas un à proprement parler. Ça peut poser divers problèmes, par exemple quand on change de thème et qu'on y revient. Le paquet ~standard-themes~ ne change pas (trop) l'apparence par défaut, mais la structure en lui donnant un vrai thème.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package standard-themes
    :config (load-theme 'standard-light t))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Standard Themes")
#+END_SRC

** Thème Leuven

Le thème Leuven, très bien intégré à Emacs (et particulièrement à [[*Org]]), est lisible et agréable en mode texte comme en mode graphique.

** Thème Nord

Le thème Nord est reposant et fonctionne bien avec iTerm2, qui en dispose également.

** Changer de thème facilement

~switch-theme~ permet d'itérer facilement sur les thèmes préconfigurés. Devrait être déjà configuré sur {{{KBD-(F9)}}} (voir [[*Raccourcis Fn]])

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun switch-theme ()
    "Itereate over some predefined themes"
    (interactive)
    (cond
     ((eq 'standard-light (car custom-enabled-themes))
      (load-theme 'standard-dark t))
     ((eq 'standard-dark (car custom-enabled-themes))
      (load-theme 'leuven t))
     ((eq 'leuven (car custom-enabled-themes))
      (load-theme 'nord t))
     (t
      (load-theme 'standard-light t))))
 #+END_SRC

* Tramp

Transfère les fichiers en utilisant ssh, plutôt que ftp

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq tramp-default-method "ssh")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Tramp")
#+END_SRC

