emacs.html
<div id="outline-container-org4cade50" class="outline-2">
<h2 id="org4cade50">TabTab minor mode</h2>
<div class="outline-text-2" id="text-org4cade50">
<p>
Change le comportement de la touche <kbd>TAB</kbd>:
</p>
<ul class="org-ul">
<li><kbd>TAB</kbd>ne sert plus à indenter la ligne, mais aligne le texte sur le prochain arrêt de tabulation</li>
<li><kbd>S</kbd>-<kbd>TAB</kbd>remplit la fonction opposée, et aligne le texte sur l'arrêt de tabulation précédent</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">prev-tab-to-tab-stop</span> <span style="color: #0000ff;">()</span>
  <span style="color: #8b2252;">"Remove spaces or tabs to next defined tab-stop column."</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">and</span> abbrev-mode <span style="color: #a0522d;">(</span>= <span style="color: #800080;">(</span>char-syntax <span style="color: #b22222;">(</span>preceding-char<span style="color: #b22222;">)</span><span style="color: #800080;">)</span> ?w<span style="color: #a0522d;">)</span>
     <span style="color: #a0522d;">(</span>expand-abbrev<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">let</span> <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>nexttab <span style="color: #b22222;">(</span>indent-next-tab-stop <span style="color: #4f7400;">(</span>current-column<span style="color: #4f7400;">)</span> t<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span>delete-horizontal-space t<span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span>indent-to nexttab<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>

<span style="color: #191970;">(</span><span style="color: #800080;">define-minor-mode</span> <span style="color: #0000ff;">tab-tab-mode</span>
  <span style="color: #8b2252;">"Tab-to-tab in both directions"</span>
  <span style="color: #483d8b;">:lighter</span> <span style="color: #8b2252;">" TTm"</span>
  <span style="color: #483d8b;">:keymap</span> <span style="color: #0000ff;">(</span><span style="color: #800080;">let</span> <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>map <span style="color: #b22222;">(</span>make-sparse-keymap<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span>define-key map <span style="color: #800080;">(</span>kbd <span style="color: #8b2252;">"&lt;tab&gt;"</span><span style="color: #800080;">)</span> 'tab-to-tab-stop<span style="color: #a0522d;">)</span>
          <span style="color: #a0522d;">(</span>define-key map <span style="color: #800080;">(</span>kbd <span style="color: #8b2252;">"S-&lt;tab&gt;"</span><span style="color: #800080;">)</span> 'prev-tab-to-tab-stop<span style="color: #a0522d;">)</span>
          map<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Écrit initialement pour <code>cmake-mode</code>. Le mode majeur doit prendre en compte la <i>key-map</i>. On active <code>tab-tab-mode</code> avec un hook
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-hook 'cmake-mode-hook 'tab-tab-mode<span style="color: #191970;">)</span>
</pre>
</div>

<p>
On peut aussi se contenter d'un <code>local-set-key</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span>add-hook 'cmake-mode-hook <span style="color: #0000ff;">(</span>local-set-key <span style="color: #a0522d;">(</span>kbd <span style="color: #8b2252;">"&lt;tab&gt;"</span><span style="color: #a0522d;">)</span> 'tab-to-tab-stop<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
Voir <a href="http://nullprogram.com/blog/2013/02/06">How to Make an Emacs Minor Mode</a> pour un tutoriel clair et bien fait.
</p>
</div>
</div>
<div id="outline-container-org8fa8061" class="outline-2">
<h2 id="org8fa8061">Tcl</h2>
<div class="outline-text-2" id="text-org8fa8061">
<p>
Ouvre les <code>.tm</code> comme des modules Tcl
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> auto-mode-alist <span style="color: #0000ff;">(</span>append '<span style="color: #a0522d;">(</span><span style="color: #800080;">(</span><span style="color: #8b2252;">"</span><span style="color: #b6532f;">\</span><span style="color: #8b2252;">.tm$"</span> . tcl-mode<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span> auto-mode-alist<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9fb9a1b" class="outline-2">
<h2 id="org9fb9a1b">Thèmes</h2>
<div class="outline-text-2" id="text-org9fb9a1b">
<p>
Les couleurs par défaut d'Emacs ne fonctionnent pas toujours bien lorsqu'il est lancé en mode texte dans un terminal en mode sombre : Les couleurs ne ressortent pas. Pour régler le problème, il faut utiliser un terminal qui supporte le mode <code>truecolor</code>, comme <a href="https://iterm2.com/">iTerm2</a>.
</p>
</div>
<div id="outline-container-org51b8098" class="outline-3">
<h3 id="org51b8098">Thème standard</h3>
<div class="outline-text-3" id="text-org51b8098">
<p>
Le thème par défaut n'en est pas un à proprement parler. Ça peut poser divers problèmes, par exemple quand on change de thème et qu'on y revient. Le paquet <code>standard-themes</code> ne change pas (trop) l'apparence par défaut, mais la structure en lui donnant un vrai thème.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> standard-themes
  <span style="color: #483d8b;">:config</span> <span style="color: #0000ff;">(</span>load-theme 'standard-light t<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge3694c6" class="outline-3">
<h3 id="orge3694c6">Thème Leuven</h3>
<div class="outline-text-3" id="text-orge3694c6">
<p>
Le thème Leuven, très bien intégré à Emacs (et particulièrement à <a href="#org935ab7a">Org</a>), est lisible et agréable en mode texte comme en mode graphique.
</p>
</div>
</div>
<div id="outline-container-org7fef5ae" class="outline-3">
<h3 id="org7fef5ae">Thème Nord</h3>
<div class="outline-text-3" id="text-org7fef5ae">
<p>
Le thème Nord est reposant et fonctionne bien avec iTerm2, qui en dispose également.
</p>
</div>
</div>
<div id="outline-container-org96015b0" class="outline-3">
<h3 id="org96015b0">Changer de thème facilement</h3>
<div class="outline-text-3" id="text-org96015b0">
<p>
<code>switch-theme</code> permet d'itérer facilement sur les thèmes préconfigurés. Devrait être déjà configuré sur <kbd>F9</kbd>(voir <a href="#org47a11f2">Raccourcis Fn</a>)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">switch-theme</span> <span style="color: #0000ff;">()</span>
  <span style="color: #8b2252;">"Itereate over some predefined themes"</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">cond</span>
   <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>eq 'standard-light <span style="color: #b22222;">(</span>car custom-enabled-themes<span style="color: #b22222;">)</span><span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>load-theme 'standard-dark t<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
   <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>eq 'standard-dark <span style="color: #b22222;">(</span>car custom-enabled-themes<span style="color: #b22222;">)</span><span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>load-theme 'leuven t<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
   <span style="color: #a0522d;">(</span><span style="color: #800080;">(</span>eq 'leuven <span style="color: #b22222;">(</span>car custom-enabled-themes<span style="color: #b22222;">)</span><span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>load-theme 'nord t<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
   <span style="color: #a0522d;">(</span>t
    <span style="color: #800080;">(</span>load-theme 'standard-light t<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc94f706" class="outline-2">
<h2 id="orgc94f706">Tramp</h2>
<div class="outline-text-2" id="text-orgc94f706">
<p>
Transfère les fichiers en utilisant ssh, plutôt que ftp
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">setq</span> tramp-default-method <span style="color: #8b2252;">"ssh"</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
