emacs.el

(defun prev-tab-to-tab-stop ()
  "Remove spaces or tabs to next defined tab-stop column."
  (interactive)
  (and abbrev-mode (= (char-syntax (preceding-char)) ?w)
	 (expand-abbrev))
  (let ((nexttab (indent-next-tab-stop (current-column) t)))
    (delete-horizontal-space t)
    (indent-to nexttab)))

(define-minor-mode tab-tab-mode
  "Tab-to-tab in both directions"
  :lighter " TTm"
  :keymap (let ((map (make-sparse-keymap)))
	      (define-key map (kbd "<tab>") 'tab-to-tab-stop)
	      (define-key map (kbd "S-<tab>") 'prev-tab-to-tab-stop)
	      map))

(add-hook 'cmake-mode-hook 'tab-tab-mode)

(last-step-duration "TabTab minor mode")

(setq auto-mode-alist (append '(("\.tm$" . tcl-mode)) auto-mode-alist))

(use-package standard-themes
  :config (load-theme 'standard-light t))

(last-step-duration "Standard Themes")

(defun switch-theme ()
  "Itereate over some predefined themes"
  (interactive)
  (cond
   ((eq 'standard-light (car custom-enabled-themes))
    (load-theme 'standard-dark t))
   ((eq 'standard-dark (car custom-enabled-themes))
    (load-theme 'leuven t))
   ((eq 'leuven (car custom-enabled-themes))
    (load-theme 'nord t))
   (t
    (load-theme 'standard-light t))))

(setq tramp-default-method "ssh")

(last-step-duration "Tramp")
