emacs.org
* Unfill

La fonction ~fill~ permet de découper correctement les lignes trop longues, et le paquet ~unfill~ fournit la fonction inverse, celle qui recolle les lignes. Et même mieux, ce paquet fournit également ~unfill-toggle~, qui passe d'un état à l'autre. Si simple et tellement utile ! Travaille sur la région si elle est définie, sur le paragraphe sinon.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package unfill
#+END_SRC

Le raccourci par défaut pour ~fill~ est remplacé sans états d'âme

#+BEGIN_SRC emacs-lisp :tangle yes
  :bind ("M-q" . unfill-toggle)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Unfill")
#+END_SRC

* Uniquify

Génère des libellés plus pertinents pour les buffers de mêmes noms

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package uniquify
#+END_SRC

Soit les fichiers ~xxx/yyy/foo.txt~ et ~zzz/ttt/foo.txt~ tous les deux ouverts dans des buffers. Plutôt que d'avoir deux buffers affichant ~foo.txt~, on aura avec la méthode ~post-forward~ les libellés ~foo.txt|xxx/yyy~ et ~foo.txt|zzz/ttt~

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq uniquify-buffer-name-style 'post-forward)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Uniquify")
#+END_SRC

* Whitespace

Un mode mineur qui permet de visualiser les espaces, de nettoyer les lignes blanches, ou encore de visualiser les lignes trop longues. Très paramétrable.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package whitespace
#+END_SRC

La variable ~whitespace-style~ contrôle les types d'espaces qui seront affichés. La première valeur, ~face~, est particulière et active la mise en évidence des espaces en changeant leur couleur de fond. Viennent ensuite :

- ~trailing~, qui met en évidence les espaces inutiles en fin de ligne
- ~lines~, qui met en évidence les lignes, essentiellement vides, ne contenant que des espaces, ainsi que les lignes trop longues (voir ~whitespace-line-column~)
- ~empty~, qui met en évidence les lignes vides en début et fin de fichier

#+BEGIN_SRC emacs-lisp :tangle yes
  :config (setq whitespace-style '(face trailing lines empty))
#+END_SRC

{{{CTRL-(h)}}} {{{KBD-(o)}}} avec le curseur sur ~whitespace-style~ vous emmènera vers la doc qui énumère toutes les catégories d'espaces. À noter que les espaces ne sont pas nécessairement mis en évidence en surlignant leur couleur de fond : on peut également les remplacer et afficher par exemple "›" à la place d'une tabulation.

Active whitespace-mode dans tous les modes de développement.

#+BEGIN_SRC emacs-lisp :tangle no
  :config (add-hook 'prog-mode-hook 'whitespace-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Whitespace")
#+END_SRC

* Ws-butler

Moins agressif que Whitespace au moment de la sauvegarde d'un fichier : nettoie uniquement les lignes modifiées et évite des diffs malheureux.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package ws-butler
    :hook (prog-mode . ws-butler-mode)
    :config (setq ws-butler-keep-whitespace-before-point nil)
  #+END_SRC

  #+BEGIN_SRC emacs-lisp :tangle no :exports none
    )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "Ws-butler")
#+END_SRC

* XML

Une fonction pour remettre en forme du XML. Prise sur le site de [[http://blog.bookworm.at/2007/03/pretty-print-xml-with-emacs.html][Benjamin Ferrari]].

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun pretty-print-xml-region (begin end)
    "Pretty format XML markup in region. You need to have nxml-mode
  http://www.emacswiki.org/cgi-bin/wiki/NxmlMode installed to do
  this.  The function inserts linebreaks to separate tags that have
  nothing but whitespace between them.  It then indents the markup
  by using nxml's indentation rules."
    (interactive "r")
    (save-excursion
      (nxml-mode)
      (goto-char begin)
      ;; split <foo><foo> or </foo><foo>, but not <foo></foo>
      (while (search-forward-regexp ">[ \t]*<[^/]" end t)
	(backward-char 2) (insert "\n") (incf end))
      ;; split <foo/></foo> and </foo></foo>
      (goto-char begin)
      (while (search-forward-regexp "<.*?/.*?>[ \t]*<" end t)
	(backward-char) (insert "\n") (incf end))
      (indent-region begin end nil)
      (normal-mode))
    (message "All indented!"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  (last-step-duration "XML")
#+END_SRC

