emacs.html
<div id="outline-container-orge53a0a8" class="outline-2">
<h2 id="orge53a0a8">Unfill</h2>
<div class="outline-text-2" id="text-orge53a0a8">
<p>
La fonction <code>fill</code> permet de découper correctement les lignes trop longues, et le paquet <code>unfill</code> fournit la fonction inverse, celle qui recolle les lignes. Et même mieux, ce paquet fournit également <code>unfill-toggle</code>, qui passe d'un état à l'autre. Si simple et tellement utile ! Travaille sur la région si elle est définie, sur le paragraphe sinon.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> unfill
</pre>
</div>

<p>
Le raccourci par défaut pour <code>fill</code> est remplacé sans états d'âme
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:bind</span> <span style="color: #191970;">(</span><span style="color: #8b2252;">"M-q"</span> . unfill-toggle<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org45ea2d4" class="outline-2">
<h2 id="org45ea2d4">Uniquify</h2>
<div class="outline-text-2" id="text-org45ea2d4">
<p>
Génère des libellés plus pertinents pour les buffers de mêmes noms
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> uniquify
</pre>
</div>

<p>
Soit les fichiers <code>xxx/yyy/foo.txt</code> et <code>zzz/ttt/foo.txt</code> tous les deux ouverts dans des buffers. Plutôt que d'avoir deux buffers affichant <code>foo.txt</code>, on aura avec la méthode <code>post-forward</code> les libellés <code>foo.txt|xxx/yyy</code> et <code>foo.txt|zzz/ttt</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> uniquify-buffer-name-style 'post-forward<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org48d631f" class="outline-2">
<h2 id="org48d631f">Whitespace</h2>
<div class="outline-text-2" id="text-org48d631f">
<p>
Un mode mineur qui permet de visualiser les espaces, de nettoyer les lignes blanches, ou encore de visualiser les lignes trop longues. Très paramétrable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> whitespace
</pre>
</div>

<p>
La variable <code>whitespace-style</code> contrôle les types d'espaces qui seront affichés. La première valeur, <code>face</code>, est particulière et active la mise en évidence des espaces en changeant leur couleur de fond. Viennent ensuite :
</p>

<ul class="org-ul">
<li><code>trailing</code>, qui met en évidence les espaces inutiles en fin de ligne</li>
<li><code>lines</code>, qui met en évidence les lignes, essentiellement vides, ne contenant que des espaces, ainsi que les lignes trop longues (voir <code>whitespace-line-column</code>)</li>
<li><code>empty</code>, qui met en évidence les lignes vides en début et fin de fichier</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span><span style="color: #800080;">setq</span> whitespace-style '<span style="color: #0000ff;">(</span>face trailing lines empty<span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>

<p>
<kbd>C</kbd>-<kbd>h</kbd><kbd>o</kbd>avec le curseur sur <code>whitespace-style</code> vous emmènera vers la doc qui énumère toutes les catégories d'espaces. À noter que les espaces ne sont pas nécessairement mis en évidence en surlignant leur couleur de fond : on peut également les remplacer et afficher par exemple "›" à la place d'une tabulation.
</p>

<p>
Active whitespace-mode dans tous les modes de développement.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #483d8b;">:config</span> <span style="color: #191970;">(</span>add-hook 'prog-mode-hook 'whitespace-mode<span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc731db" class="outline-2">
<h2 id="orgfc731db">Ws-butler</h2>
<div class="outline-text-2" id="text-orgfc731db">
<p>
Moins agressif que Whitespace au moment de la sauvegarde d'un fichier : nettoie uniquement les lignes modifiées et évite des diffs malheureux.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">use-package</span> ws-butler
  <span style="color: #483d8b;">:hook</span> <span style="color: #0000ff;">(</span>prog-mode . ws-butler-mode<span style="color: #0000ff;">)</span>
  <span style="color: #483d8b;">:config</span> <span style="color: #0000ff;">(</span><span style="color: #800080;">setq</span> ws-butler-keep-whitespace-before-point nil<span style="color: #0000ff;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e9e7b1" class="outline-2">
<h2 id="org2e9e7b1">XML</h2>
<div class="outline-text-2" id="text-org2e9e7b1">
<p>
Une fonction pour remettre en forme du XML. Prise sur le site de <a href="http://blog.bookworm.at/2007/03/pretty-print-xml-with-emacs.html">Benjamin Ferrari</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">pretty-print-xml-region</span> <span style="color: #0000ff;">(</span>begin end<span style="color: #0000ff;">)</span>
  <span style="color: #8b2252;">"Pretty format XML markup in region. You need to have nxml-mode
http://www.emacswiki.org/cgi-bin/wiki/NxmlMode installed to do
this.  The function inserts linebreaks to separate tags that have
nothing but whitespace between them.  It then indents the markup
by using nxml's indentation rules."</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span> <span style="color: #8b2252;">"r"</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">save-excursion</span>
    <span style="color: #a0522d;">(</span>nxml-mode<span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span>goto-char begin<span style="color: #a0522d;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">split &lt;foo&gt;&lt;foo&gt; or &lt;/foo&gt;&lt;foo&gt;, but not &lt;foo&gt;&lt;/foo&gt;
</span>    <span style="color: #a0522d;">(</span><span style="color: #800080;">while</span> <span style="color: #800080;">(</span>search-forward-regexp <span style="color: #8b2252;">"&gt;[ \t]*&lt;[</span><span style="color: #e00033;">^</span><span style="color: #8b2252;">/]"</span> end t<span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>backward-char 2<span style="color: #800080;">)</span> <span style="color: #800080;">(</span>insert <span style="color: #8b2252;">"\n"</span><span style="color: #800080;">)</span> <span style="color: #800080;">(</span>incf end<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">split &lt;foo/&gt;&lt;/foo&gt; and &lt;/foo&gt;&lt;/foo&gt;
</span>    <span style="color: #a0522d;">(</span>goto-char begin<span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span><span style="color: #800080;">while</span> <span style="color: #800080;">(</span>search-forward-regexp <span style="color: #8b2252;">"&lt;.*?/.*?&gt;[ \t]*&lt;"</span> end t<span style="color: #800080;">)</span>
    <span style="color: #800080;">(</span>backward-char<span style="color: #800080;">)</span> <span style="color: #800080;">(</span>insert <span style="color: #8b2252;">"\n"</span><span style="color: #800080;">)</span> <span style="color: #800080;">(</span>incf end<span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span>indent-region begin end nil<span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span>normal-mode<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span>message <span style="color: #8b2252;">"All indented!"</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
