emacs.el

(use-package unfill

:bind ("M-q" . unfill-toggle)

)

(last-step-duration "Unfill")

(use-package uniquify

:config (setq uniquify-buffer-name-style 'post-forward)

)

(last-step-duration "Uniquify")

(use-package whitespace

:config (setq whitespace-style '(face trailing lines empty))

)

(last-step-duration "Whitespace")

(last-step-duration "Ws-butler")

(defun pretty-print-xml-region (begin end)
  "Pretty format XML markup in region. You need to have nxml-mode
http://www.emacswiki.org/cgi-bin/wiki/NxmlMode installed to do
this.  The function inserts linebreaks to separate tags that have
nothing but whitespace between them.  It then indents the markup
by using nxml's indentation rules."
  (interactive "r")
  (save-excursion
    (nxml-mode)
    (goto-char begin)
    ;; split <foo><foo> or </foo><foo>, but not <foo></foo>
    (while (search-forward-regexp ">[ \t]*<[^/]" end t)
	(backward-char 2) (insert "\n") (incf end))
    ;; split <foo/></foo> and </foo></foo>
    (goto-char begin)
    (while (search-forward-regexp "<.*?/.*?>[ \t]*<" end t)
	(backward-char) (insert "\n") (incf end))
    (indent-region begin end nil)
    (normal-mode))
  (message "All indented!"))

(last-step-duration "XML")
