emacs.org
* Installation automatique

Finalement, pour simplifier la configuration d'Emacs sur une nouvelle machine, la fonction my-package-setup installe automatiquement la plupart des paquets utilisés ici. La plupart seulement, car pour certains, il est quand même préférable de voir au cas par cas s'ils sont nécessaires. Inspiré de [[https://stackoverflow.com/a/10093312][cette réponse]] sur Stack Overflow.

:NOTE:
Il faut aussi pouvoir mettre à jour la liste de package. Mais il existe sûrement une fonction du gestionnaire de package pour ça... La trouver et la documenter
:END:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my-package-setup()
    (interactive)
    
    (add-to-list 'package-archives
  			   '("MELPA" . "http://melpa.org/packages/") t)
    (unless package-archive-contents
      (package-refresh-contents))
    (dolist (package '(ac-capf
  					 ac-helm
  					 auto-complete-config
  					 bm
  					 cmake-mode
  					 corfu
  					 epa-file
  					 fuzzy
  					 graphviz-dot-mode
  					 helm
  					 helm-projectile
  					 htmlize
  					 idle-highlight-mode
  					 kind-icon
  					 leuven-theme
  					 nord-theme
  					 magit
  					 mmm-mode
  					 projectile
  					 rainbow-delimiters
  					 rainbow-mode
  					 related
  					 standard-themes
  					 unfill
  					 uniquify
  					 whitespace
  					 ws-butler
  					 ))
      (message "---> %s" package)
      (unless (package-installed-p package)
  	  (ignore-errors
  		(package-install package)))))
#+END_SRC

* Générer les fichiers :noexport:

- Générer [[elisp:(org-babel-tangle)][emacs.el]]
- Générer [[elisp:(org-html-export-to-html)][emacs.html]]


#+OPTIONS: toc:nil d:(not "NOTE") html-postamble:nil

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>

#+HTML_HEAD: <style type="text/css">
#+HTML_HEAD: /*Tdm sur 3 colonnes*/
#+HTML_HEAD: #text-table-of-contents {
#+HTML_HEAD:	padding: 1em;
#+HTML_HEAD:	column-count: 3;
#+HTML_HEAD:	column-gap: 1em;
#+HTML_HEAD: }
#+HTML_HEAD: /*Corrige le pb des liens qui sautent dans la tdm*/
#+HTML_HEAD: #text-table-of-contents a {
#+HTML_HEAD:	border-bottom: 1px dotted;
#+HTML_HEAD:	border-bottom-color: transparent;
#+HTML_HEAD: }
#+HTML_HEAD: #text-table-of-contents a:hover {
#+HTML_HEAD:	border-bottom-color: #035;
#+HTML_HEAD: }
#+HTML_HEAD: kbd {
#+HTML_HEAD:    border-radius: 2px;
#+HTML_HEAD:    padding: 1px;
#+HTML_HEAD:    border: 1px solid black;
#+HTML_HEAD: }
#+HTML_HEAD: </style>

#+MACRO: KBD- @@html:<kbd>$1</kbd>@@@@ascii:$1​@@
#+MACRO: CTRL- @@html:<kbd>C</kbd>-<kbd>$1</kbd>@@@@ascii:C-$1​@@
#+MACRO: SHIFT- @@html:<kbd>S</kbd>-<kbd>$1</kbd>@@@@ascii:S-$1​@@
#+MACRO: META- @@html:<kbd>M</kbd>-<kbd>$1</kbd>@@@@ascii:M-$1​@@
#+MACRO: CTRL-META- @@html:<kbd>C</kbd>-<kbd>M</kbd>-<kbd>$1</kbd>@@@@ascii:C-$1​@@
#+MACRO: APPLE- @@html:<kbd>⌘</kbd>-<kbd>$1</kbd>@@@@ascii:⌘-$1​@@
