emacs.html
<div id="outline-container-org25586cf" class="outline-2">
<h2 id="org25586cf">Installation automatique</h2>
<div class="outline-text-2" id="text-org25586cf">
<p>
Finalement, pour simplifier la configuration d'Emacs sur une nouvelle machine, la fonction my-package-setup installe automatiquement la plupart des paquets utilisés ici. La plupart seulement, car pour certains, il est quand même préférable de voir au cas par cas s'ils sont nécessaires. Inspiré de <a href="https://stackoverflow.com/a/10093312">cette réponse</a> sur Stack Overflow.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #191970;">(</span><span style="color: #800080;">defun</span> <span style="color: #0000ff;">my-package-setup</span><span style="color: #0000ff;">()</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">interactive</span><span style="color: #0000ff;">)</span>

  <span style="color: #0000ff;">(</span>add-to-list 'package-archives
               '<span style="color: #a0522d;">(</span><span style="color: #8b2252;">"MELPA"</span> . <span style="color: #8b2252;">"http://melpa.org/packages/"</span><span style="color: #a0522d;">)</span> t<span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">unless</span> package-archive-contents
    <span style="color: #a0522d;">(</span>package-refresh-contents<span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span>
  <span style="color: #0000ff;">(</span><span style="color: #800080;">dolist</span> <span style="color: #a0522d;">(</span>package '<span style="color: #800080;">(</span>ac-capf
                     ac-helm
                     auto-complete-config
                     bm
                     cmake-mode
                     corfu
                     epa-file
                     fuzzy
                     graphviz-dot-mode
                     helm
                     helm-projectile
                     htmlize
                     idle-highlight-mode
                     kind-icon
                     leuven-theme
                     nord-theme
                     magit
                     mmm-mode
                     projectile
                     rainbow-delimiters
                     rainbow-mode
                     related
                     standard-themes
                     unfill
                     uniquify
                     whitespace
                     ws-butler
                     <span style="color: #800080;">)</span><span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span>message <span style="color: #8b2252;">"---&gt; %s"</span> package<span style="color: #a0522d;">)</span>
    <span style="color: #a0522d;">(</span><span style="color: #800080;">unless</span> <span style="color: #800080;">(</span>package-installed-p package<span style="color: #800080;">)</span>
      <span style="color: #800080;">(</span><span style="color: #800080;">ignore-errors</span>
        <span style="color: #b22222;">(</span>package-install package<span style="color: #b22222;">)</span><span style="color: #800080;">)</span><span style="color: #a0522d;">)</span><span style="color: #0000ff;">)</span><span style="color: #191970;">)</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
