emacs.el

(defun my-package-setup()
  (interactive)
  
  (add-to-list 'package-archives
			   '("MELPA" . "http://melpa.org/packages/") t)
  (unless package-archive-contents
    (package-refresh-contents))
  (dolist (package '(ac-capf
					 ac-helm
					 auto-complete-config
					 bm
					 cmake-mode
					 corfu
					 epa-file
					 fuzzy
					 graphviz-dot-mode
					 helm
					 helm-projectile
					 htmlize
					 idle-highlight-mode
					 kind-icon
					 leuven-theme
					 nord-theme
					 magit
					 mmm-mode
					 projectile
					 rainbow-delimiters
					 rainbow-mode
					 related
					 standard-themes
					 unfill
					 uniquify
					 whitespace
					 ws-butler
					 ))
    (message "---> %s" package)
    (unless (package-installed-p package)
	  (ignore-errors
		(package-install package)))))
